Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
#include "aiio_autoconf.h"

#if CONFIG_AIIO_RADAR

#include "aiio_radar.h"

#include <stdio.h>

#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "event_groups.h"

#include "bl602.h"
#include "hosal_uart.h"
#include "hosal_i2c.h"
#include "hosal_gpio.h"
#include "hosal_spi.h"
#include "bl602_dma.h"
#include <bl_dma.h>
#include "hosal_dma.h"
#include "bl602_spi.h"
#include "bl_irq.h"
#include "nmsis_gcc.h"
#include "easyflash.h"
#include "bl602_uart.h"
#include "bl_uart.h"

#ifdef CONFIG_RADAR_UART_ENABLE
    #define USER_UART_ENABLE                (CONFIG_RADAR_UART_ENABLE)
#else
    #define USER_UART_ENABLE                (0)
#endif

#ifdef CONFIG_RADAR_UART
    #define UART_TRAN_NUM                   (CONFIG_RADAR_UART)
#else
    #define UART_TRAN_NUM                   (1)
#endif

#ifdef CONFIG_RADAR_UART_BAUDRATE
    #define USER_UART_BAUD                  (CONFIG_RADAR_UART_BAUDRATE)
#else
    #define USER_UART_BAUD                  (256000)
#endif

#ifdef CONFIG_RADAR_FACTORY_ENABLE
    #define RADAR_FACTORY_ENABLE            (CONFIG_RADAR_FACTORY_ENABLE)
#else
    #define RADAR_FACTORY_ENABLE            (1)
#endif

#define CMD_PROCESS_TASK_PRIORITY       (13)
#define UART_RECV_CHECK_TASK_PRIORITY   (12)
#define CMD_RECV_TIMEOUT                (5)

#define CMD_PROCESS_BIT     (1 << 1)

#define RADAR_I2C_SCL_PIN   (14)
#define RADAR_I2C_SDA_PIN   (3)

#define RADAR_EN_PIN        (12)
#define RADAR_POWER_PIN     (20)
#define RADAR_REXT_PIN      (21)

#define RADAR_CS_PIN        (22)

#define RADAR_POWER_TIMEOUT (60)

#define EVT_GROUP_SPI_FLAG  (1 << 1)
#define SPI_INII_STACK_SIZE (2048)

#define SPI_DMA_BUFF_LEN                    (48)

#define EVT_GROUP_SPI_TX    (1<<0)
#define EVT_GROUP_SPI_RX    (1<<1)
#define EVT_GROUP_SPI_TR    (EVT_GROUP_SPI_TX | EVT_GROUP_SPI_RX)

#define MAX_REG_NUM         (100)

#define FUNC_QUEUE_SIZE     (34)
#define SPI_FRAME_DLEN_MAX      (40)
#define SPI_FRAME_HLEN          (4)
#define SPI_FRAME_TLEN          (4)
#define SPI_FRAME_LEN_MAX       (SPI_FRAME_DLEN_MAX + SPI_FRAME_HLEN + SPI_FRAME_TLEN)
#define DATA_RECV_BUF_SIZE      (SPI_FRAME_LEN_MAX * 2) /*ping-pong buffer*/

#define DATA_HEAD		          (0xAA)
#define DATA_TAIL		          (0x55)
#define ID_MASK                   (0xF0)

#define FFT0_ID                   (0x30)
#define FFT1_ID                   (0x70)

#define DSRAW0_ID                   (0x20)
#define DSRAW1_ID                   (0x60)

#define CHIRP_INDEX_POS0          (5)
#define CHIRP_INDEX_POS1          (3)
#define CHIRP_INDEX_MASK          (0x0F)
#define SKIP_NUM                  (4)

#define DFFT0_ID                  (0xB0)
#define DFFT1_ID                  (0xF0)
#define FRAME_CNT_POS             (8)

#define DFFT_PEAK_ID              (0x40)

#define DATA_PROC_STACK_SIZE      (512)
#define RADAR_DATA_QUEUE_SIZE     (2)


#define I2C_ADDR_BanYan_Chip0		    (0x40)
#define I2C_ADDR_BanYan_Chip1		    (0x44)
#define MAX_REG_NUM                 (100)
#define REG_FIX_NUM                 (5)
#define RAW_MAP_NUM                 (5)

#define BANYAN_DIG_FUN_SWITCH       (0x01)
#define BANYAN_DIG_RAW_PEAK_NUM     (0x04)
#define BANYAN_DIG_FFT_NUM          (0x05)
#define BANYAN_DIG_FFT_SETTING      (0x0A)
#define BANYAN_DIG_DFFT_DATA_NUM    (0x0D)
#define BANYAN_DIG_DFFT_CHIRP_NUM   (0x0E)
#define BANYAN_PAT_CHIRP_NUM        (0x44)

#define BANYAN_DFFT_DATA_NUM_POS    (8)
#define BANYAN_DFFT_CHIRP_NUM_POS   (8)
#define BANYAN_RAW_POS              (8)

#define BANYAN_PEAK_MASK            (0x1F)
#define BANYAN_RAW_MASK             (0x07)

#define BIT(x)                      ((uint32_t)((uint32_t)0x01U<<(x)))
#define BANYAN_FFT_DATA             BIT(2)
#define BANYAN_DFFT_DATA            BIT(12)
#define BANYAN_DFFT_PEAK_DATA       BIT(4)
#define BANYAN_DSRAW_DATA           BIT(1)

#define INDICATOR_RECV_THRESHOLD            (1000)
#define INDICATOR_RECV_THD_DFFT_SHIFT       (3)
#define INDICATOR_RECV_THD_DPEAK_SHIFT      (6)
#define INDICATOR_SEND_OF_THRESHOLD         (10)

#define LE16_TO_BIG(x) \
            ((uint16_t)( \
                (((uint16_t)(x) & (uint16_t)0x00ffU) << 8) | \
                (((uint16_t)(x) & (uint16_t)0xff00U) >> 8)))
#define BIG16_TO_LE LE16_TO_BIG

#define I2C_ADDR_BanYan_Chip0   (0x40)

#define     ONEFFT_POINT        (10)
#define     FRAME_DEPTH         (34)
#define     ACC_DEPTH           ((FRAME_DEPTH-2) >> 2)

#define     ROI_MIN             (2)
#define     NOCOHERENTLEN       (40)

#define     RADAR_RANGE_RES     (75)/* ����ֱ��ʣ�cm�� */

#define PROTOCOL_HEAD                    (0XF1F2F3F4)
#define PROTOCOL_TAIL                    (0XF5F6F7F8)
#define REPORT_DEBUG_TYPE                (0x01)
#define REPORT_TARGET_TYPE               (0x02)

#define DATA_HEAD                        (0xAA)
#define DATA_TAIL                        (0x55)

#define REPORT_HEAD_LENGTH               (4)
#define DATA_LEN_LENGTH                  (2)
#define MAX_MOTION_BINS_LENGTH           (1)
#define MAX_MOTIONLESS_BINS_LENGTH       (1)
#define MOTION_DATA_RANGE_BIN_LENGTH     (ONEFFT_POINT)
#define MOTIONLESS_DATA_RANGE_BIN_LENGTH (ONEFFT_POINT)
#define REPORT_TAIL_LENGTH               (4)
#define TARGET_DATA_LENGTH               (9)
#define DATA_TYPE_LENGTH                 (1)
#define DATA_HEAD_LENGTH                 (1)
#define DATA_TAIL_LENGTH                 (1)
#define DATA_CHECK_LENGTH                (1)

#define CONFIDENCECNT					 (7)

#define POWER_TYPE_10HZ      (1)
#define POWER_TYPE_1HZ       (0)

#define ARRAY_SIZE(x)       (sizeof(x) / sizeof(*x))

#define APP_NFFT          (ONEFFT_POINT-1)
#define REPORT_LENGTH    (REPORT_HEAD_LENGTH +  \
                          DATA_LEN_LENGTH + \
                          DATA_TYPE_LENGTH + \
                          DATA_HEAD_LENGTH + \
                          TARGET_DATA_LENGTH + \
                          MAX_MOTION_BINS_LENGTH + \
                          MAX_MOTIONLESS_BINS_LENGTH + \
                          MOTION_DATA_RANGE_BIN_LENGTH + \
                          MOTIONLESS_DATA_RANGE_BIN_LENGTH + \
                          DATA_TAIL_LENGTH + \
                          DATA_CHECK_LENGTH+REPORT_TAIL_LENGTH)

#define UPLOAD_SAMPLE_RATE          (16)
#define RADAR_DATA_MAX_LEN          (40)
#define DEBUG_MODE_DEFAULT          (0)

#define FLASH_PAGE_SIZE             (4096)
#define FLASH_MAGIC_NUM             (0x12345678)
#define FLASH_WORD_LEN              (4)

