Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
/*	========================== 雷达参数 =============================	*/
#define PARAM_RANGE_RES                 75            //距离分辨率：75厘米

/*	=================================================================	*/


/*  ========================== 算法参数 =============================	*/
#define PARAM_MAX_MOTION_RANGE          600
#define PARAM_MAX_MOTIONLESS_RANGE      600
#define PARAM_MOTION_MAX                (PARAM_MAX_MOTION_RANGE/PARAM_RANGE_RES)
#define PARAM_MOTIONLESS_MAX            (PARAM_MAX_MOTIONLESS_RANGE/PARAM_RANGE_RES)


/*裸板*/
#define PARAM_MOTION_SENSITIBITY_RANG0  (50)
#define PARAM_MOTION_SENSITIBITY_RANG1  (50)
#define PARAM_MOTION_SENSITIBITY_RANG2  (40)
#define PARAM_MOTION_SENSITIBITY_RANG3  (40)
#define PARAM_MOTION_SENSITIBITY_RANG4  (40)
#define PARAM_MOTION_SENSITIBITY_RANG5  (40)
#define PARAM_MOTION_SENSITIBITY_RANG6  (30)
#define PARAM_MOTION_SENSITIBITY_RANG7  (30)
#define PARAM_MOTION_SENSITIBITY_RANG8  (30)


#define PARAM_MOTIONLESS_SENSITIBITY_RANG0    (5500000)//不参与判断
#define PARAM_MOTIONLESS_SENSITIBITY_RANG1    (5500000)//不参与判断
#define PARAM_MOTIONLESS_SENSITIBITY_RANG2 (40)
#define PARAM_MOTIONLESS_SENSITIBITY_RANG3 (40)
#define PARAM_MOTIONLESS_SENSITIBITY_RANG4 (40)
#define PARAM_MOTIONLESS_SENSITIBITY_RANG5 (40)
#define PARAM_MOTIONLESS_SENSITIBITY_RANG6 (15)
#define PARAM_MOTIONLESS_SENSITIBITY_RANG7 (15)
#define PARAM_MOTIONLESS_SENSITIBITY_RANG8 (15)

#define PARAM_OFF_TIME                  5       // s
/*	=================================================================	*/

//========================== CMD相关 =================================//
typedef enum  
{
	CMD_HEAD_0 = 0,
    CMD_HEAD_1,
    CMD_HEAD_2,
    CMD_HEAD_3,
    CMD_HEAD_MAX
}cmdHeadEnum;

typedef enum  
{
	CMD_TAIL_0 = 0,
    CMD_TAIL_1,
    CMD_TAIL_2,
    CMD_TAIL_3,
    CMD_TAIL_MAX
}cmdTailEnum;

#define CMD_LEN_MAX         (64)
#define CMD_REG_MAX         (25)
#define CMD_PARA_MAX        (13)
#define CMD_DATA_QUEUE_SIZE     (2)

#define CMD_LENGTH_LEN      (2)
#define CMD_TYPE_LEN        (2)
#define CMD_STATUS_LEN      (2)
#define CMD_STR_LEN         (2)
#define CMD_OVERHEAD_LEN    (CMD_HEAD_MAX + CMD_LENGTH_LEN + CMD_TYPE_LEN + CMD_TAIL_MAX)
#define CMD_BUF_LEN         (CMD_LEN_MAX - CMD_HEAD_MAX - CMD_TAIL_MAX - CMD_LENGTH_LEN)
#define CMD_LEN_HIGH_POS    (8)
#define CMD_DATA_POS_OLD    (CMD_HEAD_MAX + CMD_LENGTH_LEN + CMD_TYPE_LEN)
#define CMD_DATA_POS        (CMD_HEAD_MAX + CMD_LENGTH_LEN + CMD_TYPE_LEN + CMD_STATUS_LEN)

#define CMD_DEV_ADDR_LEN    (2)
#define CMD_REG_ADDR_LEN    (2)
#define CMD_PARA_NAME_LEN   (2)

#define START_CFG_CMD       (0x00FF)
#define FINISH_CFG_CMD      (0x00FE)
#define READ_VER_CMD	    (0x0000)
#define WRITE_REG_CMD       (0x0001)
#define READ_REG_CMD        (0x0002)
#define WRITE_MTT_CMD       (0x0003)
#define READ_MTT_CMD        (0x0004)
#define ADC_RESET_CMD       (0x0010)
#define READ_SN_CMD	        (0x0011)
#define WRITE_SYS_CMD       (0x0012)
#define READ_SYS_CMD        (0x0013)
#define CASCADING_MODE_CMD  (0x0014)
#define FFT_ZEROFILL_CMD  	(0x0015)
#define START_I2C_TEST_CMD  (0x0020)
#define STOP_I2C_TEST_CMD   (0x0021)
#define GET_I2C_TEST_RESULT_CMD  (0x0022)
#define NOP_CONFIG_CMD   		(0x0023)
#define ENTER_FACTORYMODE_CMD   (0x0024)
#define EXIT_FACTORYMODE_CMD   	(0x0025)


#define PARAM_CFG_CMD		(0x0060)    //cmd: config algorithm param to flash
#define PARAM_READ_CMD	    (0x0061)    //cmd: read algorithm param from flash or ram
#define ENABLE_DEBUG_CMD	(0x0062)
#define DISABLE_DEBUG_CMD	(0x0063)
#define THRESHOLD_SET_CMD   (0x0064)

// 增加AMPS读取雷达测试结果指令
#define AMPS_READ_RESULT   (0x00A1)

//BLE CMD
#define BLE_REBOOT_CMD      (0x00B0)    //reboot
#define BLE_RESTORE_CMD     (0x00B1)    //restore

//切换AT指令模式
#define RADAR_TO_AT_MODE_CMD    (0x00B2)


#define CMD_ACK_TYPE        (0x0100)
#define ACK_OK              (0)
#define ACK_FAIL            (1)

#define ACK_OK_OLD              (1)
#define ACK_FAIL_OLD            (0)

#define RESET_DELAY_TIME    (2)
#define SN_LEN              (3)

#define CMD_PROC_STACK_SIZE      (512)

#define _TO_STR(__str) #__str 
#define TO_STR(__str) _TO_STR(__str)// convert to string

#define XEND103_TYPE_VALUE              (0x8005)
#define RADAR_DEV_MODEL_TYPE_SN	  (0x8802)
#define RADAR_DEV_TYPE (0x8002)
//========================== END CMD相关 =================================//

#define RADAR_PROTOCOL_VERSION  (2)
#define RADAR_DEV_VER_MAJOR                 1
#define RADAR_DEV_VER_MINOR                 0
#define RADAR_DEV_VER_PATCH                 0


extern COMPLEX16_T chirp_data_clean[ONEFFT_POINT];
extern COMPLEX16_T Yone[ONEFFT_POINT];
extern COMPLEX32_T Wone[ONEFFT_POINT];
void cluster_remove(COMPLEX16_T *range_chirp);
void OneRecursiveCanceller(COMPLEX16_T *range_chirp, uint8_t start_pos, uint8_t shift);

Result BodyPresence(uint8_t* dataBuf, uint16_t index, uint8_t motion_max, uint8_t motionless_max, 
                    uint32_t *pMotion_sensitivity,uint32_t* pMotionless_sensitivity,
                    uint32_t off_time);
void EnableDebugMode(void);
void DisableDebugMode(void);
uint8_t IsInDebugMode(void);
uint8_t GetLowPowerType(void);
extern uint8_t NormalDopplerMaxVal[ONEFFT_POINT];
extern uint8_t NormalAccSum[ONEFFT_POINT];

uint32_t abs_32(int32_t src);
uint32_t Euclidean_32(uint32_t x, uint32_t y);
uint16_t abs_16(int16_t src);
uint16_t Euclidean_16(uint16_t x, uint16_t y);

static int rd01_iic_write(uint16_t dev_addr, uint8_t reg_addr, uint16_t data);
static void create_spi_init_task(void (*spi_slave_init_type)(void));
static void bsp_spi_slave_init(void);
static void Algo_SaveParameter(uint32_t*data,uint16_t len);
static void DataProc_Recv(void);
static uint16_t FillCmdAck(const uint16_t *data, uint16_t dataLen, uint16_t cmdType, uint16_t status);
static int bsp_nv_read(char *key, char *value, uint16_t val_len);
static int bsp_nv_write(char *key, char *value, uint16_t val_len);
static uint8_t Radar_GetDataType(void);
static uint16_t Radar_GetOneFrameChirpNum(void);
static uint16_t Radar_GetFftPoint(void);
static int hosal_spi_dma_pp_recv(hosal_spi_dev_t *arg, uint16_t len, uint8_t *ping_buf, uint8_t *pong_buf, void (*dma_rx_cb)(void *arg, uint32_t flag));
static void spi_slave_cfg(void);
static void bsp_spi_deinit(void);
static void rd01_power_off(void);
static void rd01_power_on(void);
static int rd01_iic_read(uint16_t devAddr, uint8_t regAddr, uint16_t *regVal);
static void uart_dma_send(uint8_t *buff, uint16_t len);

