Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
typedef struct {
    int8_t tx_dma_ch;
    int8_t rx_dma_ch;
    uint8_t rx_enable;
    EventGroupHandle_t spi_event_group;
} spi_dma_priv_t;

#pragma pack(4)
typedef struct ALGORITHM_PARAM 
{
    uint32_t nMaxMotionRangeBin;
    uint32_t nMaxMotionLessRangeBin;
    uint32_t nThresholdValOfMotion[ONEFFT_POINT-1 ];
    uint32_t nThresholdValOfMotionLess[ONEFFT_POINT-1 ];
    uint32_t nOffTime;
}ALGORITHM_PARAM_T;
#pragma pack()

typedef enum  
{
	FLASH_ELEM_RADAR = 0,
    FLASH_ELEM_SYS,
    FLASH_ELEM_MAX
}flashElemEnum;

typedef struct FLASH_ELEMENT
{
    uint32_t elemLen;
    void *elemAddr; 
}FLASH_ELEMENT_T;

#pragma pack(4)
typedef struct FLASH_DATA
{
    uint32_t magic;
    FLASH_ELEMENT_T elem[FLASH_ELEM_MAX];
}FLASH_DATA_T;
#pragma pack()

typedef enum  
{
	SYS_SYSTEM_MODE = 0,
    SYS_UPLOAD_SP_RATE,
    SYS_DEBUG_MODE
}sysParaEnum;

typedef struct SYS_PARA
{
    int16_t systemMode;
    int16_t uploadSampleRate;
    int16_t debugMode;
    int16_t pad;
}SYS_PARA_T;

typedef struct 
{
    char *magic;
    char *elem_len[FLASH_ELEM_MAX];
    char *elem_member[FLASH_ELEM_MAX];
    char *bodysensing;
    char *parameter;
} elem_key_t;

typedef struct CMD_PARSE
{
    uint8_t buf[CMD_BUF_LEN];
    uint8_t state;
    uint16_t curIndex;
    uint16_t len;
}CMD_PARSE_T;

typedef enum  
{
	CMD_STATE_HEAD0 = 0,
    CMD_STATE_HEAD1,
    CMD_STATE_HEAD2,
    CMD_STATE_HEAD3,
    CMD_STATE_LEN0,
    CMD_STATE_LEN1,
    CMD_STATE_DATA,
    CMD_STATE_TAIL0,
    CMD_STATE_TAIL1,
    CMD_STATE_TAIL2,
    CMD_STATE_TAIL3
}cmdStateEnum;

typedef enum  
{
	NOPCONFIG_ENABLE = 0,
    NOPCONFIG_STARTTIME,
    NOPCONFIG_STOPTIME,
	NOPCONFIG_STARTREGISTER,
	NOPCONFIG_STOPREGISTER,
}nopCofigParaEnum;

typedef struct CMD 
{
	uint16_t cmdType;
	uint16_t cmdData[0];
}CMD_T;

typedef struct CMD_REG 
{
	uint16_t addr;
	uint16_t val;
}CMD_REG_T;

#pragma pack(1)
typedef struct CMD_PARA 
{
	uint16_t type;
	int32_t val;
}CMD_PARA_T;
#pragma pack()

static hosal_i2c_dev_t i2c0;
static hosal_gpio_dev_t en_gpio;
static hosal_gpio_dev_t power_gpio;
static hosal_gpio_dev_t rext_gpio;
static hosal_gpio_dev_t cs_io;
static hosal_spi_dev_t spi;

TimerHandle_t timer_60ms_handle;
static EventGroupHandle_t SPIEventGroup;
QueueHandle_t SpiDataQueue;
TaskHandle_t QueueTaskHandle = NULL;

StackType_t xInitStack[SPI_INII_STACK_SIZE];
StaticTask_t xInitTaskBuffer;

static uint8_t sg_spi_enable = 0;

DMA_LLI_PP_Struct rx_dmaLliPPStruct = {0};
volatile static uint8_t dma_irq_cnt = 0;
volatile uint8_t g_dataRecvFlag[1][2];
uint8_t *pbuff;
uint8_t g_dataRecvBuf[1][DATA_RECV_BUF_SIZE];
static uint8_t is_yone_buffer_clear = 0;

static FLASH_DATA_T flashData;
static uint8_t needFlashWrite = 0;
static SYS_PARA_T sysPara __attribute__((aligned (4)));
static uint8_t CmdModeFlag = 0;
static uint8_t DebugModeFlag = 0;
static uint16_t masterProtocolVer = 0;
static uint8_t enableNopConfig = 0;
static uint8_t nopConfigStartRegisterIndex = 0;
static uint8_t nopConfigStopRegisterIndex = 0;
static uint16_t nopConfigStartMs = RESET_DELAY_TIME;
static uint16_t nopConfigStopMs = RESET_DELAY_TIME + 2;
int32_t nopConfigStartRegister[16] = {0};
int32_t nopConfigStopRegister[16] = {0};
static uint8_t g_FtcmdFlag = 0;
static uint8_t g_TxCount = (1 + 1) / 2;

static uint16_t start_cfg_ack[2] = {0};
static const uint16_t read_ver_ack[5] = {XEND103_TYPE_VALUE, 0x00, RADAR_DEV_VER_MAJOR,
                                                                 RADAR_DEV_VER_MINOR,
                                                                 RADAR_DEV_VER_PATCH};

uint8_t rx_ping_buf[SPI_DMA_BUFF_LEN] __attribute__((at(0x42020000)));   // __attribute__((section(".ram_data")));
uint8_t rx_pong_buf[SPI_DMA_BUFF_LEN] __attribute__((at(0x42021000)));   //__attribute__((section(".ram_data")));
uint8_t rx_buf_max[SPI_DMA_BUFF_LEN*2] __attribute__((at(0x42022000)));  // __attribute__((section(".ram_data")));

RADAR_DATA_PARSE_T RadarDataParse[1];
RADAR_PARA_T RadarPara;
/* 低功耗类型，用于两种低功耗切换   POWER_TYPE_1HZ：1s检测一次   POWER_TYPE_10HZ：100ms检测一次 */
static uint8_t lowPowerType = POWER_TYPE_10HZ;
ALGORITHM_PARAM_T gAlgorithmParam;
/* 上报数据缓冲区 */
static uint8_t ReportBuffer[REPORT_LENGTH] __ALIGNED(4) = {0};

static volatile uint8_t g_uartDmaSendingFlag = 0;
static CMD_RECV_T g_cmdRecv;
static CMD_PARSE_T CmdDataParse;
static const uint8_t CmdHead[CMD_HEAD_MAX] = {0xFD, 0xFC, 0xFB, 0xFA};
static const uint8_t CmdTail[CMD_TAIL_MAX] = {0x04, 0x03, 0x02, 0x01};
static uint8_t CmdAck[CMD_LEN_MAX] __attribute__((aligned (4))) = {0};

static rd01_data_output_t data_output_cb = NULL;
static rd01_cmd_ack_t cmd_ack_cb = NULL;

HOSAL_UART_DEV_DECL(uart_dev_int, UART_TRAN_NUM, 16, 7, 256000);
EventGroupHandle_t CmdProcessEventGroup;

static elem_key_t elem_key = 
{
    .magic = "magic",
    .elem_len[0] = "elemLen1",
    .elem_len[1] = "elemLen2",
    .elem_member[0] = "elem_mb1",
    .elem_member[1] = "elem_mb2",
    .bodysensing = "bodyss",
    .parameter = "param",
};

static uint16_t rawPointMap[RAW_MAP_NUM] = 
{
	RAW_POINT_64,
    RAW_POINT_128,
    RAW_POINT_256,
    RAW_POINT_512,
    RAW_POINT_1024
};

static RADAR_REG_T InitRegList[MAX_REG_NUM] __attribute__((aligned (4))) =
{
    {0x40, 0x4207},
    {0x41, 0x0004},
    {0x01, 0x0000},
    {0x67, 0x0000},
    {0x72, 0x0650},
    {0x42, 0x0001},
    {0x43, 0xD4C0},
    {0x44, 0x0022},
    {0x45, 0x0000},
    {0x46, 0x0FA0},
    {0x47, 0x1001},
    {0x48, 0x57C0},
    {0x49, 0x2000},
    {0x4A, 0x55F0},
    {0x4B, 0x0000},
    {0x4C, 0x1770},
    {0x4D, 0x0000},
    {0x4E, 0x0001},
    {0x4F, 0x0001},
    {0x50, 0x86A0},
    {0x51, 0x0003},
    {0x52, 0x0D40},
    {0x53, 0x0A02},
    {0x54, 0xAAAB},
    {0x55, 0x0000},
    {0x56, 0x0011},
    {0x57, 0xFFFF},
    {0x58, 0xFFBC},
    {0x59, 0x0000},
    {0x5A, 0x0000},
    {0x5B, 0x0022},
    {0x5C, 0x0022},
    {0x5D, 0x1919},
    {0x5E, 0xFF00},
    {0x61, 0x02B5},
    {0x62, 0x02B5},
    {0x63, 0x02B5},
    {0x64, 0x02B5},
    {0x6E, 0x83FC},
    {0x66, 0x0A00},
    {0x6C, 0x9990},
    {0x6D, 0x9580},
    {0x70, 0x2EA0},
    {0x76, 0x0021},
    {0x02, 0x2064},
    {0x04, 0x020C},
    {0x09, 0x6901},
    {0x0A, 0xC200},
    {0x0B, 0xC064},
    {0x05, 0x000A},
    // {0x06, 0x11FE}, // 1.538Mhz  可以收
    // {0x06, 0x11B7}, // 1.987MHz  可以收
    // {0x06, 0x1192}, // 2.510MHz  收不完整
    // {0x06, 0x017F}, // 2.980MHz  收不完整
    // {0x06, 0x015B}, // 3.974MHz  收不完整
    // {0x06, 0x0137}, // 5.960MHz  收不完整
    // {0x06, 0x0125}, // 7.947MHz  收不到
    {0x06, 0x0123}, // 12MHz     收不到
    {0x0D, 0x1E00},
    {0x0E, 0x2200},
    {0x14, 0x5A03},
    {0x15, 0x1708},
    {0x17, 0x0210},
    {0x20, 0x0000},
    {0x21, 0x0000},
    {0x22, 0x0000},
    {0x23, 0x1DDC},
    {0x24, 0x1D5E},
    {0x25, 0x1CE2},
    {0x26, 0x1C64},
    {0x27, 0x17D0},
    {0x28, 0x16D4},
    {0x29, 0x15DC},
    {0x2A, 0x15DC},
    {0x2B, 0x15DC},
    {0x2C, 0x15DC},
    {0x2D, 0x15DC},
    {0x2E, 0x15DC},
    {0x2F, 0x15DC},
    {0x72, 0x0793},
    {0x67, 0x1840},
    {0x01, 0x8E24},
    {0x41, 0xC844},
    {0x40, 0x0207},
    {0x00, 0x0000} /*must be last, do not delete!!!*/
};

