Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
#if RADAR_FACTORY_ENABLE

#define FT_DATA_LEN         (40)
#define FT_QUEUE_SIZE       (512)   // n*40 bytes   chirpNum: 64, dataLen: 40

#define  NOISE_CONVERGENCE_CNT    (15)
#define  FT_NOISE_START           (4)
#define  FT_NOISE_STOP            (8)
#define  FT_NOISE_NUM             (FT_NOISE_STOP - FT_NOISE_START)
#define  FT_NOISE_VAL             (14)

#define RADAR_CHIRP_NUM           (64U)

#define PARA_LEN_KEY        "datalen"
#define PARA_DATA_KEY       "paradata"

#define FACTORY_RESULT_KEY  "ft_result"

#define RADAR_AT_MODE_KET   "rd_cmd_mode"

#define DFFT_PEAK_DATA_LEN  (0x6C)

static QueueHandle_t ft_queue_handle = NULL;
static TaskHandle_t ft_queue_task_handle = NULL;
static uint8_t ft_ping_buff[40];
static uint8_t ft_pong_buff[40];
static uint8_t radarRegNeedUpDate = 0;

static COMPLEX16_T factory_test_filter[FT_NOISE_NUM] = {0};
static COMPLEX32_T factory_test_chirp_power[FT_NOISE_NUM] = {0};

static uint32_t NoCoherentAccBuf[NOCOHERENTLEN][FT_NOISE_NUM] = {0};
static uint32_t FT_bin_mag[FT_NOISE_NUM] = {0};
static uint32_t AccSum[FT_NOISE_NUM];
static uint16_t nStable_cnt = 0;
static uint16_t nCurLoop = 0;

static RADAR_REG_T ft_InitRegList[MAX_REG_NUM] __attribute__((aligned (4))) =
{
    {0x40, 0x4207},
    {0x41, 0x0004},
    {0x01, 0x0000},
    {0x67, 0x0000},
    {0x72, 0x0650},
    {0x42, 0x0001},
    {0x43, 0x1940},
    {0x44, 0x0040},
    {0x45, 0x0000},
    {0x46, 0x0FA0},
    {0x47, 0x1000},
    {0x48, 0xABE0},
    {0x49, 0x2000},
    {0x4A, 0x2EE0},
    {0x4B, 0x0000},
    {0x4C, 0x2EE0},
    {0x4D, 0x0000},
    {0x4E, 0x0001},
    {0x4F, 0x0000},
    {0x50, 0x0FA0},
    {0x51, 0x0070},
    {0x52, 0xEA40},
    {0x53, 0x09CA},
    {0x54, 0xAAAB},
    {0x55, 0x0000},
    {0x56, 0x00BF},
    {0x57, 0xFFFF},
    {0x58, 0xFD44},
    {0x59, 0x0000},
    {0x5A, 0x0000},
    {0x5B, 0x0022},
    {0x5C, 0x0022},
    {0x5D, 0x1919},
    {0x5E, 0xFF00},
    {0x61, 0x0021},
    {0x62, 0x0021},
    {0x63, 0x0021},
    {0x64, 0x0021},
    {0x66, 0x0A00},
    {0x6C, 0x9990},
    {0x6D, 0x9DC0},
    {0x6E, 0x83FC},
    {0x70, 0x3EA0},
    {0x76, 0x0021},
    {0x06, 0x0124},
    // {0x06, 0x11FE},     // 1.538MHz
    {0x02, 0x1032},
    {0x04, 0x020C},
    {0x09, 0x6901},
    {0x0A, 0x4200},
    {0x0B, 0xC032},
    {0x05, 0x0008},
    {0x0D, 0x0800},
    {0x0E, 0x4000},
    {0x15, 0x1708},
    {0x14, 0x5A03},
    {0x17, 0x0210},
    {0x20, 0x0000},
    {0x21, 0x0000},
    {0x22, 0x0000},
    {0x23, 0x1DDC},
    {0x24, 0x1D5E},
    {0x25, 0x1CE2},
    {0x26, 0x1C64},
    {0x27, 0x17D0},
    {0x28, 0x16D4},
    {0x29, 0x15DC},
    {0x2A, 0x15DC},
    {0x2B, 0x15DC},
    {0x2C, 0x15DC},
    {0x2D, 0x15DC},
    {0x2E, 0x15DC},
    {0x2F, 0x15DC},
    {0x72, 0x0653},
    {0x67, 0x1840},
    {0x01, 0x8E24},
    {0x41, 0xC854},
    {0x40, 0x0207},
    {0x00, 0x0000} /*must be last, do not delete!!!*/
};

static void OneRecursiveCanceller_for_ft(COMPLEX16_T *range_chirp, uint8_t start_pos, uint8_t num, uint8_t shift)
{
    uint8_t fast_index = 0;
    COMPLEX32_T clear32 = {0,0};

    for(fast_index=start_pos; fast_index< num; fast_index++)
    {
        clear32.real = ((int32_t)range_chirp[fast_index].real << 10) - (Wone[fast_index].real >> shift);
        clear32.imag = ((int32_t)range_chirp[fast_index].imag << 10) - (Wone[fast_index].imag >> shift);

        Wone[fast_index].real += clear32.real;
        Wone[fast_index].imag += clear32.imag;

        Yone[fast_index].real = clear32.real >> 10;
        Yone[fast_index].imag = clear32.imag >> 10;
    }
}

static void DoFactoryTestDataSend(uint8_t* frameBuf, uint16_t bufLen, uint16_t index)
{
    uint8_t         i,j           = 0;
    float           f_real      = 0.0f;
    uint16_t        u16_real    = 0;
    const  uint8_t  coe         = 3;
    uint32_t           Noise       = 0;
    static uint8_t  nExpIndex   = 0;
    static uint8_t   stable_flag = 0;

    /* Check chirp index */
    if (index != nExpIndex)
    {
        nExpIndex = 0;
    }
    nExpIndex = (nExpIndex + 1) % FRAME_DEPTH;

    /* Data transfer into complex */
    for(i = FT_NOISE_START; i < FT_NOISE_STOP; i++)
    {
        factory_test_filter[i-FT_NOISE_START].real = (frameBuf[i*4+0+4] << 8) + frameBuf[i*4+1+4];
        factory_test_filter[i-FT_NOISE_START].imag = (frameBuf[i*4+2+4] << 8) + frameBuf[i*4+3+4];
    }

    /* Do IIR filter */
    OneRecursiveCanceller_for_ft(factory_test_filter, 0, FT_NOISE_NUM, coe);

    /* chirp累积（实数） */
    for(i = 0; i < FT_NOISE_NUM; i++)
    {
        factory_test_chirp_power[i].real += (int32_t)Yone[i].real;
        factory_test_chirp_power[i].imag += (int32_t)Yone[i].imag;
    }

    /* Last chirp, start to send data */
    if (index == (RADAR_CHIRP_NUM - 1))
    {
        printf("last chirp\r\n");
        nStable_cnt++;

        for(i = 0; i < FT_NOISE_NUM; i++)
        {
            FT_bin_mag[i] = Euclidean_32(abs_32(factory_test_chirp_power[i].real),
                                         abs_32(factory_test_chirp_power[i].imag));
        }
        
        for(i = 0; i < FT_NOISE_NUM; i++)
        {
            NoCoherentAccBuf[nCurLoop][i] = FT_bin_mag[i];
        }

        nCurLoop++;
        if (nCurLoop == NOCOHERENTLEN)
        {
            nCurLoop = 0;
        }
        
        /* 非相干累积 */
        for(i = 0; i < FT_NOISE_NUM; i++)
        {
            for(j = 0; j < NOCOHERENTLEN; j++)
            {
                AccSum[i] += (uint32_t)NoCoherentAccBuf[j][i];
            }
            AccSum[i] = AccSum[i] >> 5;
        }

        for(i = 0; i < FT_NOISE_NUM; i++)
        {
            Noise += AccSum[i];
        }

        f_real = (float)Noise / 1.414f;
        f_real /= (float)FT_NOISE_NUM;

        u16_real = (uint16_t)(f_real * 100.0f + 0.5f);

        // printf("Noise=%d\r\n", Noise);
        // printf("Noise / FT_NOISE_NUM = %d\r\n", Noise / FT_NOISE_NUM);
        // printf("nStable_cnt:%d\r\n", nStable_cnt);
        if(Noise / FT_NOISE_NUM < FT_NOISE_VAL || nStable_cnt > NOISE_CONVERGENCE_CNT)
        {
            stable_flag = 1;
        }
        if(0 == stable_flag)
        {
            // printf("0 == stable_flag\r\n");
            memset(factory_test_chirp_power, 0, sizeof(factory_test_chirp_power));
            return;
        }

