Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
        // printf("%.3f\r\n", 10.0f*log10f(u16_real*u16_real*2.0f)-40.0f);
        // printf("Mag:%d,Real:%d,Noise:%.3fdBm\r\n", Noise/4, u16_real, 10.0f*log10f(u16_real*u16_real*2.0f)-40.0f);

        frameBuf[1] = 0x30;
        frameBuf[2] = 0x38;
        frameBuf[38] = 0x37;

        /* Recover last range bin data */
        frameBuf[(ONEFFT_POINT-1)*4+0+4] = (u16_real & 0xFF00) >> 8;
        frameBuf[(ONEFFT_POINT-1)*4+1+4] = (u16_real & 0x00FF) >> 0;
        frameBuf[(ONEFFT_POINT-1)*4+2+4] = (u16_real & 0xFF00) >> 8;
        frameBuf[(ONEFFT_POINT-1)*4+3+4] = (u16_real & 0x00FF) >> 0;

        /* Send data */
    #if USER_UART_ENABLE
        while(1 == g_uartDmaSendingFlag){}
        g_uartDmaSendingFlag = 1;
        uart_dma_send(frameBuf, bufLen);

        if (data_output_cb)
        {
            data_output_cb(frameBuf, bufLen);
        }
        memset(factory_test_chirp_power, 0, sizeof(factory_test_chirp_power));

        while(1 == g_uartDmaSendingFlag){}
    #else
        if (data_output_cb)
        {
            data_output_cb(frameBuf, bufLen);
        }
        memset(factory_test_chirp_power, 0, sizeof(factory_test_chirp_power));
    #endif//USER_UART_ENABLE
    }
}

static uint16_t Radar_GetDfftDataNum(void)
{
    uint16_t val = 32;
    
    rd01_iic_read(I2C_ADDR_BanYan_Chip0, BANYAN_DIG_DFFT_DATA_NUM, &val);

    return (val >> BANYAN_DFFT_DATA_NUM_POS);
}

static uint16_t Radar_GetDfftChirpNum(void)
{
    uint16_t val = 32;
    
    rd01_iic_read(I2C_ADDR_BanYan_Chip0, BANYAN_DIG_DFFT_CHIRP_NUM, &val);

    return (val >> BANYAN_DFFT_CHIRP_NUM_POS);
}

static uint16_t DoExitFactoryMode(CMD_T *cmd, uint32_t cmdLen)
{
	uint16_t ackLen = 0;
	ackLen = FillCmdAck(NULL, 0, cmd->cmdType, ACK_OK);
    return ackLen;
}

static uint32_t Config_ReadRadarParaLen(void)
{
    uint32_t dataLen = 0;

    bsp_nv_read(PARA_LEN_KEY, (char *)&dataLen, sizeof(dataLen));

    return dataLen;
}

static void Config_WriteRadarPara2Flash(uint32_t* addr, uint16_t len)
{
    uint32_t dataLen = len;
    
    bsp_nv_write(PARA_LEN_KEY, (char *)&dataLen, sizeof(dataLen));
    bsp_nv_write(PARA_DATA_KEY, (char *)addr, len);
}

static void Config_ReadRadarParaData(uint32_t* addr, uint16_t len)
{
    bsp_nv_read(PARA_DATA_KEY, (char *)addr, len);
}

static void ft_spi_dma_handler_rx(void *arg, uint32_t flag)
{
    BaseType_t xResult = pdFAIL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    hosal_spi_dev_t *dev = (hosal_spi_dev_t *)arg;
    if (NULL != dev)
    {
        if (dev->config.dma_enable)
        {
            spi_dma_priv_t *priv = (spi_dma_priv_t *)dev->priv;
            bl_dma_int_clear(priv->rx_dma_ch);

            if (ft_queue_handle != NULL)
            {
                uint8_t *buff;

                if (dma_irq_cnt == 0)
                {
                    buff = ft_ping_buff;
                    dma_irq_cnt = 1;
                }
                else
                {
                    buff = ft_pong_buff;
                    dma_irq_cnt = 0;
                }

                xResult = xQueueSendFromISR(ft_queue_handle, buff, &xHigherPriorityTaskWoken);
                if (xResult != pdFAIL)
                {
                    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
                }
            }
            else
            {
                printf("\r\nft_queue_handle==null\r\n");
            }
        }
    }
    else
    {
        printf("hosal_spi_int_handler_rx no clear isr.\r\n");
    }
}

static void ft_queue_data_process_task(void *param)
{
    uint8_t spidatabuff[40];
    uint8_t index = 0;

    for (;;)
    {
        xQueueReceive(ft_queue_handle, spidatabuff, portMAX_DELAY);

    #if RAW_DATA_LOG_ENABLE
        for (size_t i = 0; i < sizeof(spidatabuff); i++)
        {
            printf("0x%02X ", spidatabuff[i]);
        }
        printf("\r\n");
    #endif

        memcpy(&g_dataRecvBuf[0][index], spidatabuff, RadarPara.dataLen);

        if (index == 0)
        {
            g_dataRecvFlag[0][0] = 1;
            index = RadarPara.dataLen;
        }
        else
        {
            g_dataRecvFlag[0][1] = 1;
            index = 0;
        }

        DataProc_Recv();
    }
}

static int ft_create_queue_and_task(void)
{
    dma_irq_cnt = 0;

    if (ft_queue_handle == NULL)
    {
        ft_queue_handle = xQueueCreate(FT_QUEUE_SIZE, FT_DATA_LEN);
        if (ft_queue_handle == NULL)
        {
            printf("creat ft queue failed\r\n");
            return -1;
        }
    }
    else
    {
        printf("reset ft queue\r\n");
        xQueueReset(ft_queue_handle);
    }
    
    if (ft_queue_task_handle == NULL)
    {
        BaseType_t err = xTaskCreate(ft_queue_data_process_task, "ft_queue_task", 512, NULL, 14, &ft_queue_task_handle);
        if (err != pdPASS)
        {
            printf("create ft_queue_data_process_task failed\r\n");
            return -1;
        }
    }

    return 0;
}

static void Radar_SaveRegList(void)
{
    uint16_t loop = 0;
    
    if (!radarRegNeedUpDate)
    {
        return;
    }

    while(ft_InitRegList[loop].addr) 
    {
        loop++;
    }
    loop++;
    
    Config_WriteRadarPara2Flash((uint32_t*)ft_InitRegList, loop * sizeof(RADAR_REG_T));
    radarRegNeedUpDate = 0;
}

static void Ft_Radar_Init(void)
{
    uint16_t loop = 0;
    uint32_t paraLen = 0;

    paraLen = Config_ReadRadarParaLen();

    if (paraLen == 0 || paraLen > ((64+16) * sizeof(RADAR_REG_T)))
    {
        radarRegNeedUpDate = 1;
        Radar_SaveRegList();
        paraLen = Config_ReadRadarParaLen();
    }
    
    printf("paraLen: 0x%x\r\n", paraLen);
    Config_ReadRadarParaData((uint32_t*)ft_InitRegList, paraLen);
    
#if 1
    while(ft_InitRegList[loop].addr)
    {
        printf("0x%02x:0x%04x\r\n", ft_InitRegList[loop].addr, ft_InitRegList[loop].val);
        loop++;
    }
    loop = 0;
#endif

    while(ft_InitRegList[loop].addr) 
    {
        rd01_iic_write(I2C_ADDR_BanYan_Chip0, (uint8_t)(ft_InitRegList[loop].addr), ft_InitRegList[loop].val);
        loop++;
    }

    vTaskDelay(31);
}

static void Ft_DataProc_Init(void)
{
    uint8_t dfftDataNum = 0;
    uint8_t dfftChirpNum = 0;
    
