Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
    memset(&RadarDataParse, 0 ,sizeof(RadarDataParse));
    memset(&RadarPara, 0 ,sizeof(RadarPara));
    RadarPara.dataType = Radar_GetDataType();//FFT - 0, DFFT - 1, dFFT PEAK -2, MAX -3
    printf("dataType: %d\r\n", RadarPara.dataType);

    RadarPara.chirpNum = Radar_GetOneFrameChirpNum();
    printf("chirpNum: %d\r\n", RadarPara.chirpNum);

    switch (RadarPara.dataType)
    {
        case DATA_TYPE_FFT:
            RadarPara.dataLen = Radar_GetFftPoint() * 2 * 2 + SPI_FRAME_HLEN + SPI_FRAME_TLEN;
            break;
        case DATA_TYPE_DFFT:
            dfftDataNum = Radar_GetDfftDataNum();
            dfftChirpNum = Radar_GetDfftChirpNum();
            RadarPara.dataLen = dfftDataNum * 2 * 2 * dfftChirpNum + SPI_FRAME_HLEN + SPI_FRAME_TLEN;  /*16 bit, IQ*/
            break;
        case DATA_TYPE_DFFT_PEAK:
            RadarPara.dataLen = DFFT_PEAK_DATA_LEN + SPI_FRAME_HLEN + SPI_FRAME_TLEN;
            break;
        default:
            break;
    }

    printf("dataLen: %d\r\n", RadarPara.dataLen);

    RadarDataParse[0].needCopyLen = RadarPara.dataLen - SPI_FRAME_HLEN - SPI_FRAME_TLEN;
}

static void ft_bsp_spi_slave_init(void)
{
    spi_slave_cfg();

    memset(g_dataRecvBuf[0], 0x00, sizeof(g_dataRecvBuf[0]));

    hosal_spi_dma_pp_recv(&spi, FT_DATA_LEN, ft_ping_buff, ft_pong_buff, ft_spi_dma_handler_rx);
}

static void Ft_System_Reconfig(void)
{
    static uint8_t reconfig_cnt = 0;

    if (reconfig_cnt != 0)  // No reconfiguration in production mode
        return;

    reconfig_cnt = 1;

    bsp_spi_deinit();
    rd01_power_off();
    // cs_interrupt_init();
    vTaskDelay(5);
    rd01_power_on();

    Ft_Radar_Init();            // 写产测iic
    Ft_DataProc_Init();         // 初始化数据

    create_spi_init_task(ft_bsp_spi_slave_init);
}

#endif //RADAR_FACTORY_ENABLE

int32_t aiio_rd01_data_output_cb_register(rd01_data_output_t cb)
{
    data_output_cb = cb;
    return 0;
}

int32_t aiio_rd01_cmd_ack_cb_register(rd01_cmd_ack_t cb)
{
    cmd_ack_cb = cb;
    return 0;
}

static void rd01_en_gpio_init(uint8_t status)
{
    en_gpio.port = RADAR_EN_PIN;
    en_gpio.config = OUTPUT_PUSH_PULL;
    hosal_gpio_init(&en_gpio);
    hosal_gpio_output_set(&en_gpio, status);
}

static void rd01_power_gpio_init(uint8_t status)
{
    power_gpio.port = RADAR_POWER_PIN;
    power_gpio.config = OUTPUT_OPEN_DRAIN_PULL_UP;
    hosal_gpio_init(&power_gpio);
    hosal_gpio_output_set(&power_gpio, status);
}

static void rd01_power_on(void)
{
    hosal_gpio_output_set(&power_gpio, 0);
}

static void rd01_power_off(void)
{
    hosal_gpio_output_set(&power_gpio, 1);
}

void rd01_rext_gpio_init(uint8_t status)
{
    rext_gpio.port = RADAR_REXT_PIN;
    rext_gpio.config = OUTPUT_PUSH_PULL;
    hosal_gpio_init(&rext_gpio);
    hosal_gpio_output_set(&rext_gpio, status);
}

void rd01_rext_on(void)
{
    hosal_gpio_output_set(&rext_gpio, 1);
}

static void rd01_i2c_init(int scl_pin, int sda_pin)
{
    int ret     = -1;

    i2c0.port = 0;
    i2c0.config.freq = 100000;                                    /* only support 305Hz~100000Hz */
    i2c0.config.address_width = HOSAL_I2C_ADDRESS_WIDTH_7BIT;     /* only support 7bit */
    i2c0.config.mode = HOSAL_I2C_MODE_MASTER;                     /* only support master */
    i2c0.config.scl = scl_pin;
    i2c0.config.sda = sda_pin;

    /* init i2c with the given settings */
    ret = hosal_i2c_init(&i2c0);
    if (ret != 0) 
    {
        hosal_i2c_finalize(&i2c0);
        printf("hosal i2c init failed!\r\n");
        return;
    }
}

void WriteSocAllReg(void)
{
    uint16_t loop = 0;
    
    while(InitRegList[loop].addr) 
    {
        rd01_iic_write(I2C_ADDR_BanYan_Chip0, (uint8_t)(InitRegList[loop].addr), InitRegList[loop].val);
        loop++;
    }
}

void setSOCEnterNormalMode(void)
{
    rd01_power_on();
    vTaskDelay(10);
    // vTaskEnterCritical();      // 不进入临界区可能会导致雷达无数据出现
    vTaskSuspendAll();
    WriteSocAllReg();
    // vTaskExitCritical();
    xTaskResumeAll();
}

static void timer_timeout_func(TimerHandle_t xTimer)
{
    setSOCEnterNormalMode();

    create_spi_init_task(bsp_spi_slave_init);
}

/**
 * 串口DMA发送完成回调
 */
static int __uart_tx_dma_callback(void *p_arg)
{
    /* If TX transmission is completed */
    g_uartDmaSendingFlag = 0;
    return 0;
}

static void uart_dma_send(uint8_t *buff, uint16_t len)
{
#if 1
    hosal_uart_dma_cfg_t txdam_cfg = {
        .dma_buf = buff,
        .dma_buf_size = len,
    };

    /* Start a UART TX DMA transfer */
    hosal_uart_ioctl(&uart_dev_int, HOSAL_UART_DMA_TX_START, &txdam_cfg);
#else
    hosal_uart_send(&uart_dev_int, buff, len);
    g_uartDmaSendingFlag = 0;
#endif
}

/**
 * 中断回调
 */
static void __uart_rx_callback(void *p_arg)
{
	int cnt;
    hosal_uart_dev_t *p_dev = (hosal_uart_dev_t *)p_arg;

    cnt = hosal_uart_receive(p_dev, &g_cmdRecv.buf[g_cmdRecv.bufRecv][g_cmdRecv.curIndex], RADAR_CMD_RECV_BUF_SIZE);

    g_cmdRecv.curIndex += cnt;
    g_cmdRecv.idleCnt = 0;
    if (g_cmdRecv.curIndex >= RADAR_CMD_RECV_BUF_SIZE)
    {
        g_cmdRecv.cmdReady = 1;
        g_cmdRecv.bufProc = g_cmdRecv.bufRecv;
        g_cmdRecv.bufRecv = (++g_cmdRecv.bufRecv) % BUF_MAX;
        g_cmdRecv.bufLen = g_cmdRecv.curIndex;
        g_cmdRecv.curIndex = 0;
		// setUartRecv_Flag();

        BaseType_t xHigherPriorityTaskWoken, xResult;

        xHigherPriorityTaskWoken = pdFALSE;
        xResult = xEventGroupSetBitsFromISR(CmdProcessEventGroup, CMD_PROCESS_BIT, &xHigherPriorityTaskWoken );

        /* Was the message posted successfully? */
        if( xResult != pdFAIL )
        {
            /* If xHigherPriorityTaskWoken is now set to pdTRUE then a context
            switch should be requested.  The macro used is port specific and will
            be either portYIELD_FROM_ISR() or portEND_SWITCHING_ISR() - refer to
            the documentation page for the port being used. */
            portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
        }
    }
}

static void bsp_uart_init(int uart_id, int baudrate)
{
    uart_dev_int.config.uart_id = uart_id;
    uart_dev_int.config.baud_rate = baudrate;
    /* Uart init device */
    hosal_uart_init(&uart_dev_int);

    /* Set DMA TX RX transmission complete interrupt callback */
    hosal_uart_callback_set(&uart_dev_int, HOSAL_UART_TX_DMA_CALLBACK,
                          __uart_tx_dma_callback, &uart_dev_int);

    bl_uart_int_rx_notify_register(uart_dev_int.port, __uart_rx_callback, &uart_dev_int);

    // hosal_uart_ioctl(&uart_dev_int, HOSAL_UART_DMA_TX_START, &txdma_cfg);

    bl_uart_int_rx_enable(uart_dev_int.port);
#if (UART_TRAN_NUM==1)
    bl_irq_register(UART1_IRQn, UART1_IRQHandler);
    bl_irq_enable(UART1_IRQn);
#elif (UART_TRAN_NUM==0)
    bl_irq_register(UART0_IRQn, UART0_IRQHandler);
    bl_irq_enable(UART0_IRQn);
#endif
}

static void rd01_platform_init(void)
{
#if USER_UART_ENABLE
    bsp_uart_init(UART_TRAN_NUM, USER_UART_BAUD);
    uart_dma_send((uint8_t *)"Rd-01 version: 1.0.0\r\n", strlen("Rd-01 version: 1.0.0\r\n"));
#endif
    rd01_i2c_init(RADAR_I2C_SCL_PIN, RADAR_I2C_SDA_PIN);

    rd01_en_gpio_init(1);

    // soc断电
    rd01_power_gpio_init(1); //pmos控制，高电平不导通
    // 上电后，REXT先不接地
    rd01_rext_gpio_init(0);  //nmos控制，低电平不导通

    //REXT 断开后延迟3毫秒，来自AN10014C
    vTaskDelay(3);

    // Soc上电   
    rd01_power_on();
    vTaskDelay(7);  

