Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
    // 配置定时器60ms中断
    timer_60ms_handle = xTimerCreate("timer_ms", pdMS_TO_TICKS(RADAR_POWER_TIMEOUT), pdFALSE, (void *)0, timer_timeout_func);

    printf("Platform_Init done\r\n");
}

static int rd01_iic_write(uint16_t dev_addr, uint8_t reg_addr, uint16_t data)
{
    // 需要连续写
    uint8_t databuff[3];
    databuff[0] = reg_addr;
    databuff[1] = (uint8_t)(data >> 8);
    databuff[2] = (uint8_t)(data);

    dev_addr >>= 1;

    hosal_i2c_master_send(&i2c0, dev_addr, (const uint8_t *)databuff, sizeof(databuff)/sizeof(databuff[0]), HOSAL_WAIT_FOREVER);

	return 0;
}

static int rd01_iic_read(uint16_t devAddr, uint8_t regAddr, uint16_t *regVal)
{  
    uint16_t val = 0;
    uint8_t *pval = (uint8_t *)&val; 

    devAddr >>= 1;

    hosal_i2c_mem_read(&i2c0, devAddr, regAddr, HOSAL_I2C_MEM_ADDR_SIZE_8BIT, pval, sizeof(val), HOSAL_WAIT_FOREVER);
    *regVal = BIG16_TO_LE(val);

	return 0;
}

static void rd01_reg_init(void)
{
    uint16_t loop = 0;
    uint16_t data;

    while(InitRegList[loop].addr)
    {
        rd01_iic_write(I2C_ADDR_BanYan_Chip0, (uint8_t)(InitRegList[loop].addr), InitRegList[loop].val);
        loop++;
    }

    loop = 0; 
    while(InitRegList[loop].addr) 
    {
        data = 0;
        rd01_iic_read(I2C_ADDR_BanYan_Chip0, (uint8_t)(InitRegList[loop].addr), &data);
        printf("InitRegList[%d].addr=0x%02x, data=0x%04x\r\n", loop, InitRegList[loop].addr, data);
        loop++;
    }

    vTaskDelay(22);
    rd01_rext_on();  //REXT接地
    vTaskDelay(23);
}

uint8_t GetLowPowerType(void)
{
	return lowPowerType;
}

static uint8_t Radar_GetDataType(void)
{
    uint8_t dataType = DATA_TYPE_FFT;
    uint16_t val;
    
    rd01_iic_read(I2C_ADDR_BanYan_Chip0, BANYAN_DIG_FUN_SWITCH, &val);

    if (val & BANYAN_DFFT_DATA)
    {
        dataType = DATA_TYPE_DFFT;
    }
    else if (val & BANYAN_FFT_DATA)
    {
        dataType = DATA_TYPE_FFT;
    }
    else if (val & BANYAN_DFFT_PEAK_DATA)
    {
        dataType = DATA_TYPE_DFFT_PEAK;
    }
	else if (val & BANYAN_DSRAW_DATA)
    {
        dataType = DATA_TYPE_DSRAW;
    }
    else
    {
        dataType = DATA_TYPE_MAX;
    } 

    return dataType;
}

static uint16_t Radar_GetRawPoint(void)
{
    uint16_t val = 256;
    uint16_t rawVal = 0;
    
    rd01_iic_read(I2C_ADDR_BanYan_Chip0, BANYAN_DIG_RAW_PEAK_NUM, &val);
    rawVal = (val >> BANYAN_RAW_POS) & BANYAN_RAW_MASK;

    if (rawVal < RAW_MAP_NUM)
    {
        return rawPointMap[rawVal];
    }
    else
    {
        return RAW_POINT_64;
    }
}

static uint16_t Radar_GetFftPoint(void)
{
	uint16_t regVal = 64;
    rd01_iic_read(I2C_ADDR_BanYan_Chip0, BANYAN_DIG_FFT_NUM, &regVal);
	return regVal;
}

uint16_t Radar_GetDfftPeakSize(void)
{
    uint16_t val = 32;
    
    rd01_iic_read(I2C_ADDR_BanYan_Chip0, BANYAN_DIG_RAW_PEAK_NUM, &val);

    return ((val & BANYAN_PEAK_MASK) * 4); /*4--word length*/
}

static uint16_t Radar_GetOneFrameChirpNum(void)
{
	uint16_t val = 32;
    rd01_iic_read(I2C_ADDR_BanYan_Chip0, BANYAN_PAT_CHIRP_NUM, &val);
	return val;
}

static int8_t GetRadarPara(RADAR_PARA_T *radarPara)
{
    if (NULL == radarPara)
    {
        return -1;
    }
    
    radarPara->dataType = Radar_GetDataType();

    printf("dataType=%d\r\n", radarPara->dataType);

    switch (radarPara->dataType)
    {
		case DATA_TYPE_DSRAW:
            radarPara->dataLen = Radar_GetRawPoint() * 2 * 2 + SPI_FRAME_HLEN + SPI_FRAME_TLEN;  /*16 bit, IQ*/
            break;
        
        case DATA_TYPE_FFT:
            radarPara->dataLen = Radar_GetFftPoint() * 2 * 2 + SPI_FRAME_HLEN + SPI_FRAME_TLEN;  /*16 bit, IQ*/
            break;
        
        case DATA_TYPE_DFFT_PEAK:
            radarPara->dataLen = Radar_GetDfftPeakSize() + SPI_FRAME_HLEN + SPI_FRAME_TLEN;
            break;
        
        default:
            printf("Error: unsupport dataType\r\n");
            return -1;
    }

    printf("dataLen=%d\r\n", radarPara->dataLen);

    if (radarPara->dataLen > SPI_FRAME_LEN_MAX)
    {
        printf("Error: dataLen is too long\r\n");
        return -1;
    }

    radarPara->chirpNum = Radar_GetOneFrameChirpNum();

    printf("chirpNum=%d\r\n", radarPara->chirpNum);
    
    return 0;
}

static void rd01_data_proc_init(void)
{
    uint8_t channel = 0;
    
    memset(&RadarDataParse, 0 ,sizeof(RadarDataParse));
    memset(&RadarPara, 0 ,sizeof(RadarPara));

    if (GetRadarPara(&RadarPara) != 0)  // IIC读取雷达参数
    {
        printf("get radar param failed!\r\n");
    }

    for (channel = 0; channel < 1; channel++)
    {
        RadarDataParse[channel].needCopyLen = RadarPara.dataLen - SPI_FRAME_HLEN - SPI_FRAME_TLEN;
    }
}

static void DataStateIdParse(uint8_t data, uint8_t channel)
{
    uint8_t flag = 0;
    
    switch (RadarPara.dataType)
    {
        case DATA_TYPE_FFT: // ID由4bit组成，FFT_ID: 0 – FFT0, 1 – FFT1，所以数据为3或7
            if ((data & ID_MASK) == FFT0_ID || (data & ID_MASK) == FFT1_ID)
            {
				if(channel > 1)
				{
					data += 0x20;
				}
                RadarDataParse[channel].chirpIndex = (data & CHIRP_INDEX_MASK) << CHIRP_INDEX_POS0;
                flag = 1;
            }
            break;
        case DATA_TYPE_DSRAW:
            if ((data & ID_MASK) == DSRAW0_ID || (data & ID_MASK) == DSRAW1_ID)
            {
				if(channel > 1)
				{
					data += 0x20;
				}
                RadarDataParse[channel].chirpIndex = (data & CHIRP_INDEX_MASK) << CHIRP_INDEX_POS0;
                flag = 1;
            }
            break;
        case DATA_TYPE_DFFT:
			if ((data & ID_MASK) == DFFT0_ID || (data & ID_MASK) == DFFT1_ID)
            {
				if(channel > 1)
				{
					data -= 0x80;
				}
                flag = 1;
			}
            break;
        
        case DATA_TYPE_DFFT_PEAK:
            if ((data & ID_MASK) == DFFT_PEAK_ID)
            {			
                flag = 1;
			}
            break;
        
        default:
            break;
    }

    if (flag)
    {
        RadarDataParse[channel].buf[RadarDataParse[channel].curIndex++] = data;
        RadarDataParse[channel].state = DATA_STATE_INDEX1;
    }
    else
    {
        RadarDataParse[channel].state = DATA_STATE_HEAD;
    }
}

static void DataStateIndex1Parse(uint8_t data, uint8_t channel)
{
    switch (RadarPara.dataType)
		case DATA_TYPE_DSRAW:
    {
        case DATA_TYPE_FFT:
            RadarDataParse[channel].chirpIndex += data >> CHIRP_INDEX_POS1;
            break;
        
        case DATA_TYPE_DFFT:
            RadarDataParse[channel].frameCnt = data << FRAME_CNT_POS;
            break;
        
        case DATA_TYPE_DFFT_PEAK:
            break;
        
        default:
            break;
    }

    RadarDataParse[channel].buf[RadarDataParse[channel].curIndex++] = data;
    RadarDataParse[channel].state = DATA_STATE_INDEX2;
}

static void DataStateIndex2Parse(uint8_t data, uint8_t channel)
{
    switch (RadarPara.dataType)
    {
        case DATA_TYPE_FFT:
            break;
        
        case DATA_TYPE_DFFT:
            RadarDataParse[channel].frameCnt += data;
            break;
        
        case DATA_TYPE_DFFT_PEAK:
            break;
        
        default:
            break;
    }
    
    RadarDataParse[channel].buf[RadarDataParse[channel].curIndex++] = data;
    RadarDataParse[channel].state = DATA_STATE_DATA;
}

static void DataCopy(uint8_t* buf, uint16_t len, uint8_t channel, uint16_t *i)
{
    uint16_t copyLen = 0;

    if (NULL == buf || NULL == i)
    {
        return;
    }
    
	copyLen = (RadarDataParse[channel].needCopyLen > (len - *i))?
            (len - *i) : RadarDataParse[channel].needCopyLen;
    memcpy(&RadarDataParse[channel].buf[RadarDataParse[channel].curIndex], &buf[*i], copyLen);

    RadarDataParse[channel].curIndex += copyLen;
    *i += (copyLen - 1);
    RadarDataParse[channel].needCopyLen -= copyLen;

    if (!RadarDataParse[channel].needCopyLen)
    {
    	RadarDataParse[channel].state = DATA_STATE_TAIL0;
        RadarDataParse[channel].needCopyLen = RadarPara.dataLen - SPI_FRAME_HLEN - SPI_FRAME_TLEN;
    }
}

static uint8_t DataStateTail2Parse(uint8_t data, uint8_t channel)
{
    switch (RadarPara.dataType)
    {
        case DATA_TYPE_FFT:
			if(channel > 1)
			{
				data += 0x20;
			}
            break;
				
        case DATA_TYPE_DSRAW:
			if(channel > 1)
			{
				data += 0x20;
			}
            
            break;
        
        default:
            break;
    }

	RadarDataParse[channel].buf[RadarDataParse[channel].curIndex++] = data;
	RadarDataParse[channel].state = DATA_STATE_TAIL3;
    return 1;
}

static uint8_t DataStateTail3Parse(uint8_t data, uint8_t channel)
{
    RadarDataParse[channel].state = DATA_STATE_HEAD;
    if (data != DATA_TAIL) 
    {
        return 0;
    }

    RadarDataParse[channel].buf[RadarDataParse[channel].curIndex++] = data;
    
    return 1;
}

static uint8_t DataParse(uint8_t* buf, uint16_t len, uint8_t channel, uint16_t* left)
{
    uint16_t i = 0;
    uint8_t parseFinish = 0;
	*left = len;
	
    if (NULL == buf || 0 == len || channel >= 1)
    {
        return 0;
    }

