Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
	for (i = 0; (i < len) && (parseFinish == 0); i++) 
    {		
        switch(RadarDataParse[channel].state)   // 数据解析状态
		{                    
			case DATA_STATE_HEAD:               // 包头原封不动存入buffer
				if (buf[i] == DATA_HEAD) 
                {
                    RadarDataParse[channel].curIndex = 0;
                    RadarDataParse[channel].buf[RadarDataParse[channel].curIndex++] = buf[i];
					RadarDataParse[channel].state = DATA_STATE_ID;
				}
				break;
                
			case DATA_STATE_ID:
                DataStateIdParse(buf[i], channel);
				break;
                
			case DATA_STATE_INDEX1:
                DataStateIndex1Parse(buf[i], channel);
				break;
                
			case DATA_STATE_INDEX2:
                DataStateIndex2Parse(buf[i], channel);
				break;
            
			case DATA_STATE_DATA:	
                DataCopy(buf, len, channel, &i);
				break;

            case DATA_STATE_TAIL0:
                RadarDataParse[channel].buf[RadarDataParse[channel].curIndex++] = buf[i];
				RadarDataParse[channel].state = DATA_STATE_TAIL1;
				break;

            case DATA_STATE_TAIL1:
                RadarDataParse[channel].buf[RadarDataParse[channel].curIndex++] = buf[i];
				RadarDataParse[channel].state = DATA_STATE_TAIL2;
				break;

            case DATA_STATE_TAIL2:
				DataStateTail2Parse(buf[i], channel);
				break;
                
   		    case DATA_STATE_TAIL3:
                parseFinish = DataStateTail3Parse(buf[i], channel);
				break;
			
			default:
				RadarDataParse[channel].state = DATA_STATE_HEAD;
				break;
		}
	}

	*left -= i;
	
    return parseFinish;
}

static void CheckChirpIndex(uint8_t channel, uint8_t chirpIndex)
{
    static uint8_t curIndex[1] = {0};
    static uint8_t oldCurIndex[1] = {0};
    static uint8_t skipNum = SKIP_NUM;

    if (channel >= 1)
    {
        return;
    }
        
	if (skipNum) 
    {
		skipNum--;
		curIndex[channel] = oldCurIndex[channel] = chirpIndex % RadarPara.chirpNum;
	} 
    else 
    {
		curIndex[channel] = chirpIndex % RadarPara.chirpNum;
		if (curIndex[channel] != ((oldCurIndex[channel] + 1) % RadarPara.chirpNum))
        {
			// Indicator_RadarDataIndexError();
		}
		oldCurIndex[channel] = curIndex[channel];
	}
}

static void CheckFrameCnt(uint8_t channel, uint16_t frameCnt)
{
    static uint16_t oldFrameCnt[1] = {0};
    static uint8_t skipNum = SKIP_NUM;

    if (channel >= 1)
    {
        return;
    }
    
	if (skipNum) 
    {
		skipNum--;
		oldFrameCnt[channel] = frameCnt;
	} 
    else if (frameCnt != oldFrameCnt[channel] + 1)
    {
        // Indicator_RadarDataIndexError();
    }
    oldFrameCnt[channel] = frameCnt;
}

/********************************************
 @名称；CheckFullFrame
 @功能：判断MCU是否收到完整帧
 @参数：chirpIndex， 待检查chirp索引
 @返回：-1，错误的帧索引; 0，帧索引正确，不是完整帧; 1，接收完整帧
 @作者：AE TEAM
*********************************************/
static int8_t CheckFullFrame(uint16_t index)
{
    static uint8_t nExpIndex = 0;
    if (index == nExpIndex) 
    {
        nExpIndex = (nExpIndex + 1) % FRAME_DEPTH;
    }
    else
    {
        nExpIndex = 0;
		/*解决烧录后上电第一次数据异常的问题*/
		// if(isFirstRun() == 0)
			// NVIC_SystemReset();  //TODO 暂时注释
        return -1;
    }

    if (index == (FRAME_DEPTH-1))
    {
        return 1;
    }

    return 0;
}

static void bsp_spi_deinit(void)
{
    if (sg_spi_enable != 0)
    {
       hosal_spi_finalize(&spi);
       sg_spi_enable = 0;
    }
}

static uint16_t FillReportBuf(Result * result)
{
    uint8_t  pos = 0;
    uint16_t ret = REPORT_LENGTH - MAX_MOTION_BINS_LENGTH - MAX_MOTIONLESS_BINS_LENGTH - MOTION_DATA_RANGE_BIN_LENGTH - MOTIONLESS_DATA_RANGE_BIN_LENGTH;
    uint16_t report_length = TARGET_DATA_LENGTH + DATA_TYPE_LENGTH + DATA_HEAD_LENGTH + DATA_TAIL_LENGTH + DATA_CHECK_LENGTH;
    uint8_t  report_type   = REPORT_TARGET_TYPE;
    memset(ReportBuffer, 0, sizeof(ReportBuffer));

    /* 1、填充协议头部 */
    *(uint32_t*)&ReportBuffer[pos] = (uint32_t)PROTOCOL_HEAD;
    pos += REPORT_HEAD_LENGTH;
    
    /* 2、填充数据类型，长度。长度包括数据类型，数据头，数据，数据尾，校验 */
    if(IsInDebugMode())
    {
        report_length += (MOTION_DATA_RANGE_BIN_LENGTH + MOTIONLESS_DATA_RANGE_BIN_LENGTH + MAX_MOTION_BINS_LENGTH + MAX_MOTIONLESS_BINS_LENGTH);
        report_type =  REPORT_DEBUG_TYPE;
    }
    *(uint16_t*)&ReportBuffer[pos] =  report_length;
    pos += DATA_LEN_LENGTH;
    ReportBuffer[pos] = report_type;
    pos += DATA_TYPE_LENGTH;
    
    /* 4、填充数据头部 */
    ReportBuffer[pos] = DATA_HEAD;
    pos += DATA_HEAD_LENGTH;

    /* 5、填充目标信息 */
    ReportBuffer[pos++] = result->status;

   *(uint16_t*)&ReportBuffer[pos] = result->Motion_Distance;
    pos += 2;

    ReportBuffer[pos++] = result->Motion_MaxVal;
    
    *(uint16_t*)&ReportBuffer[pos] = result->MotionLess_Distance;
    pos += 2;

    ReportBuffer[pos++] = result->MotionLess_MaxVal;
    
    *(uint16_t*)&ReportBuffer[pos] = result->Distance;
    pos += 2;
   
    /* 6、如果是DEBUG类型，则填充距离门信息，最后一个距离门的信息上报，但作为保留信息，上位机不解析 */
    if(IsInDebugMode())
    {
        /* 最远运动距离门 */
        ReportBuffer[pos] = (uint16_t)(APP_NFFT - 1);
        pos += MAX_MOTION_BINS_LENGTH;

        /* 最远微动距离门 */
        ReportBuffer[pos] = (uint16_t)(APP_NFFT - 1);
        pos += MAX_MOTIONLESS_BINS_LENGTH;

        /* 运动距离门能量值 */
        for(uint8_t k = 0; k < APP_NFFT; k++)
        {
            ReportBuffer[pos++] = NormalDopplerMaxVal[k];
        }
    
        /* 微动距离门能量值 */
        NormalAccSum[0] = 0;
        NormalAccSum[1] = 0;
        for(uint8_t k = 0; k < APP_NFFT; k++)
        {
           ReportBuffer[pos++] = NormalAccSum[k];
        }
        ReportBuffer[pos++] = NormalDopplerMaxVal[APP_NFFT];
        ReportBuffer[pos++] = NormalAccSum[APP_NFFT];
    } 
     /* 7、填充协议尾部 */
    ReportBuffer[pos] = DATA_TAIL;
    pos += DATA_TAIL_LENGTH;

    ReportBuffer[pos] = 0x00;
    pos += DATA_CHECK_LENGTH;

    *(uint32_t*)&ReportBuffer[pos] = (uint32_t)PROTOCOL_TAIL;

    if(IsInDebugMode())
    {
        ret = REPORT_LENGTH;
    }
    return ret;
}

static void AlgoResultTransfer(Result * result)
{
    uint8_t len = 0;
    /* 填充并发送数据 */
    len = FillReportBuf(result);

    if(data_output_cb != NULL)
    {
        data_output_cb(ReportBuffer, len);
    }

    /* Uart DMA 发送数据 */
#if USER_UART_ENABLE
    if (g_uartDmaSendingFlag == 0)
    {
        g_uartDmaSendingFlag = 1;
        uart_dma_send(ReportBuffer, len);
    }

    while(1 == g_uartDmaSendingFlag){}
#endif

