Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
    // for (size_t i = 0; i < len; i++)
    // {
    //     printf("%02X ", ReportBuffer[i]);
    // }
    // printf("\r\n");
}

static uint8_t CmdProc_InCmdMode(void)
{
    return CmdModeFlag;
}

static uint8_t CmdProc_IsInDebugMode(void)
{
    return DebugModeFlag;
}

static void DataDispatch(uint8_t* frameBuf, uint16_t bufLen, uint8_t channel, uint16_t index)
{
    uint8_t* dataBuf = NULL;
    uint16_t dataLen = 0;
	Result mResult;
	
    if (NULL == frameBuf || 0 == bufLen)
    {
        return;
    }

    dataBuf = frameBuf + SPI_FRAME_HLEN;
    dataLen = bufLen - SPI_FRAME_HLEN - SPI_FRAME_TLEN;

#if 1
	if (CmdProc_InCmdMode()/* || (g_axk_ble_radar_cfg.get_cmd_mode_flag()) || (g_axk_ble_ota_ctrl.get_update_flag()) */)
    {
    #if RADAR_WORK_MODE_LOG_ENABLE
        printf("Cmd Mode!!!\r\n");
    #endif
        return;
    }
#endif

#if RADAR_FACTORY_ENABLE
	if (g_FtcmdFlag != 0) 
    {
        DoFactoryTestDataSend(frameBuf, bufLen, index);
        return;
    }
#endif//RADAR_FACTORY_ENABLE

	if(CmdProc_IsInDebugMode()) 
    {
        EnableDebugMode();
    }
    else
    {
        DisableDebugMode();
    }
    
	if(is_yone_buffer_clear == 0)
    {
        is_yone_buffer_clear = 1;
        memset(Yone, 0, sizeof(Yone));
        memset(Wone, 0, sizeof(Wone));
    }

    if(1 == CheckFullFrame(index))
    {
    #if COMPLETE_DATA_LOG_ENABLE
        printf("\r\nfull frame\r\n");
    #endif

    #if 1
        bsp_spi_deinit();

        /* SoC进入低功耗 */
        rd01_power_off();

        if (SpiDataQueue != NULL)
            xQueueReset(SpiDataQueue);
    #endif

        xTimerReset(timer_60ms_handle, pdMS_TO_TICKS(10));
    }

    mResult = BodyPresence(frameBuf, index,
                           gAlgorithmParam.nMaxMotionRangeBin,
                           gAlgorithmParam.nMaxMotionLessRangeBin,
                           gAlgorithmParam.nThresholdValOfMotion,
                           gAlgorithmParam.nThresholdValOfMotionLess,
                           gAlgorithmParam.nOffTime);

    if(NOBODY != mResult.status)
    {
		lowPowerType = POWER_TYPE_10HZ;
    }
    else
    {
		lowPowerType = POWER_TYPE_1HZ;
    }

	if(1 == mResult.bNeedReport)
    {
    #if COMPLETE_DATA_LOG_ENABLE
        printf("report result\r\n");
    #endif

        /* 填充并发送数据 */
        AlgoResultTransfer(&mResult);

        /* 等待数据完成 */
        // while(1 == g_uartDmaSendingFlag){}

        /* 置数据处理完成标志位 */
        // setFrameLsatChirpDataFinished();
    }
}

static void CmdProc_NopConfig(void)
{
    if (enableNopConfig 
		&& (nopConfigStopMs > nopConfigStartMs)
		&& CmdModeFlag == 0)
    {     
		uint16_t loop = 0;

		vTaskDelay(nopConfigStartMs);

		for(loop = 0; loop < nopConfigStartRegisterIndex; loop++)
		{
			int32_t val = nopConfigStartRegister[loop];
			CMD_REG_T *cmdReg = (CMD_REG_T *)(&val);
            rd01_iic_write(I2C_ADDR_BanYan_Chip0, cmdReg->addr, cmdReg->val);
			if(g_TxCount > 1)
			{
                rd01_iic_write(I2C_ADDR_BanYan_Chip1, cmdReg->addr, cmdReg->val);
			}
		}

		vTaskDelay(nopConfigStartMs);

		for(loop = 0; loop < nopConfigStopRegisterIndex; loop++)
		{
			int32_t val = nopConfigStopRegister[loop];
			CMD_REG_T *cmdReg = (CMD_REG_T *)(&val);

            rd01_iic_write(I2C_ADDR_BanYan_Chip0, cmdReg->addr, cmdReg->val);

			if(g_TxCount > 1)
			{
                rd01_iic_write(I2C_ADDR_BanYan_Chip1, cmdReg->addr, cmdReg->val);
			}
		}
    }
}

static void DoNopConfig(uint8_t channel)
{
    switch (RadarPara.dataType)
    {
		case DATA_TYPE_DSRAW:
        case DATA_TYPE_FFT:
            if ((RadarDataParse[channel].chirpIndex == RadarPara.chirpNum - 1) && (channel == 1 - 1))
            {
				CmdProc_NopConfig();
            }

            break;
        
        case DATA_TYPE_DFFT:             
            if (channel == 1 - 1)
            {
				CmdProc_NopConfig();
            }
            break;
        
        case DATA_TYPE_DFFT_PEAK:
            break;
        
        default:
            break;
    }	
}

static void DataProcess(uint8_t channel, uint8_t dmaFlag, uint8_t *recvBuf, uint16_t bufLen)
{
    uint8_t parseFinish = 0;
    uint16_t bufLeftLen = bufLen;
    uint16_t index = 0;
    uint16_t threshold = 1000;
    
    if (channel >= 1 || dmaFlag >= 2 || NULL == recvBuf)
    {
        printf("Error para!\r\n");
        return;
    }

	while (bufLeftLen > 0)
	{
		parseFinish = DataParse(recvBuf + bufLen - bufLeftLen, bufLeftLen, channel, &bufLeftLen);

		g_dataRecvFlag[channel][dmaFlag] = 0;

		if (!parseFinish)
		{
			continue;
		}
		
		switch (RadarPara.dataType)
		{
			case DATA_TYPE_DSRAW:
			case DATA_TYPE_FFT:
				CheckChirpIndex(channel, RadarDataParse[channel].chirpIndex);
				index = RadarDataParse[channel].chirpIndex;
				break;
			
			case DATA_TYPE_DFFT:
				CheckFrameCnt(channel, RadarDataParse[channel].frameCnt);	
				index = RadarDataParse[channel].frameCnt;
				threshold >>= INDICATOR_RECV_THD_DFFT_SHIFT;
				break;
			
			case DATA_TYPE_DFFT_PEAK:
				threshold >>= INDICATOR_RECV_THD_DPEAK_SHIFT;
				break;
			
			default:
				break;
		}
		
        DataDispatch(RadarDataParse[channel].buf, RadarPara.dataLen, channel, index);	
	}

    DoNopConfig(channel);
}

static void DataProc_Recv(void)
{
    uint8_t channel = 0;
    uint8_t dmaFlag = 0;
    uint16_t dataPos = 0;

    for (dmaFlag = 0; dmaFlag < 2; dmaFlag++)   // 2个buffer
    {
        if (!g_dataRecvFlag[channel][dmaFlag])  // 未接收完成
        {
            continue;
        }
        
        if (0 == dmaFlag)                       // buffer0
        {
            dataPos = 0;
        }
        else                                    // buffer1
        {
            dataPos = RadarPara.dataLen;        // 第二个buffer的起始位置
        }
        
        DataProcess(channel, dmaFlag, &g_dataRecvBuf[channel][dataPos], RadarPara.dataLen);
    }
}

static void queue_data_process_task(void *param)
{
    uint8_t spidatabuff[48];
    uint8_t index = 0;

    for (;;)
    {
        xQueueReceive(SpiDataQueue, spidatabuff, portMAX_DELAY);

    #if RAW_DATA_LOG_ENABLE
        for (size_t i = 0; i < sizeof(spidatabuff); i++)
        {
            printf("0x%02X ", spidatabuff[i]);
        }
        printf("\r\n");
    #endif

        memcpy(&g_dataRecvBuf[0][index], spidatabuff, RadarPara.dataLen);

