Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
        if (index == 0)
        {
            g_dataRecvFlag[0][0] = 1;
            index = RadarPara.dataLen;
        }
        else
        {
            g_dataRecvFlag[0][1] = 1;
            index = 0;
        }

        DataProc_Recv();
    }
}

void cs_io_irq(void *arg)
{
    BaseType_t xResult = pdFAIL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if (SPIEventGroup != NULL)
    {
        xResult = xEventGroupSetBitsFromISR(SPIEventGroup, EVT_GROUP_SPI_FLAG, &xHigherPriorityTaskWoken);
        if(xResult != pdFAIL) 
        {
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }
    }
}

void cs_interrupt_init(void)
{
    cs_io.port = RADAR_CS_PIN;
    cs_io.config = INPUT_PULL_UP;
    hosal_gpio_init(&cs_io);
    hosal_gpio_irq_set(&cs_io, HOSAL_IRQ_TRIG_NEG_PULSE, cs_io_irq, NULL);
}

void spi_init_task(void *param)
{
    EventBits_t uxBits;

    void (*func_init)(void) = param;

    for(;;)
    {
        uxBits = xEventGroupWaitBits(SPIEventGroup, EVT_GROUP_SPI_FLAG, pdTRUE, pdFALSE, portMAX_DELAY);
        if (uxBits & EVT_GROUP_SPI_FLAG)
        {
            // hosal_gpio_finalize(&cs_io);
            // hosal_gpio_irq_mask(&cs_io, 1); 
            func_init();
            break;
        }
    }

    vTaskDelete(NULL);
}

static void create_spi_init_task(void (*spi_slave_init_type)(void))
{
    TaskHandle_t handle;
    handle = xTaskCreateStatic(
                            spi_init_task,       /* Function that implements the task. */
                            "spi_init_t",          /* Text name for the task. */
                            SPI_INII_STACK_SIZE,      /* Number of indexes in the xStack array. */
                            spi_slave_init_type,    /* Parameter passed into the task. */
                            14,                     /* Priority at which the task is created. */
                            xInitStack,          /* Array to use as the task's stack. */
                            &xInitTaskBuffer );  /* Variable to hold the task's data structure. */

    if (handle == NULL)
    {
        printf("create spi_init_task failed\r\n");
    }
}

static void spi_slave_cfg(void)
{
    /* spi port set */
    spi.port = 0;
    /* spi master mode */
    spi.config.mode = HOSAL_SPI_MODE_SLAVE;

    spi.config.dma_enable = 1; // 使能DMA

    spi.config.polar_phase = 0;
    spi.config.freq = 40000000; // 雷达spi主机clk freq为12.5MHz，需要比它大
    spi.config.pin_clk = 11;
    /* pin cs now must be pin 2 */
    spi.config.pin_mosi = 0;
    spi.config.pin_miso = 0xff;
    /* init spi device */
    hosal_spi_init(&spi);

    sg_spi_enable = 1;
}

static int hosal_spi_dma_pp_recv(hosal_spi_dev_t *arg, uint16_t len, uint8_t *ping_buf, uint8_t *pong_buf, void (*dma_rx_cb)(void *arg, uint32_t flag))
{
    EventBits_t uxBits;
    BaseType_t xResult = pdFAIL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    DMA_LLI_Cfg_Type rxllicfg;
    DMA_LLI_Ctrl_Type *ptxlli = NULL;
    spi_dma_priv_t *dma_arg = (spi_dma_priv_t*)arg->priv;

    struct DMA_Control_Reg rx_dmaCtrlRegVal = {
        .TransferSize = len/4,
        .SBSize = DMA_BURST_SIZE_1,
        .DBSize = DMA_BURST_SIZE_1,
        .SWidth = DMA_TRNS_WIDTH_32BITS,
        .DWidth = DMA_TRNS_WIDTH_32BITS,
        .SI = DMA_MINC_DISABLE,
        .DI = DMA_MINC_ENABLE,
        .I = 1,
    };

    if (!arg) {
        printf("arg err.\r\n");
        return -1;
    }

    if (dma_arg->rx_dma_ch == -1) {
        dma_arg->rx_dma_ch = hosal_dma_chan_request(0);
        if (dma_arg->rx_dma_ch < 0) {
            printf("SPI TX DMA CHANNEL get failed!\r\n");
            return -1;
        }
    }
    
    rxllicfg.dir = DMA_TRNS_P2M;
    rxllicfg.srcPeriph = DMA_REQ_SPI_RX; 
    rxllicfg.dstPeriph = DMA_REQ_NONE;

    xEventGroupClearBits(dma_arg->spi_event_group, EVT_GROUP_SPI_TR);

    SPI_Enable(arg->port, SPI_WORK_MODE_SLAVE);

    rx_dmaLliPPStruct.dmaChan = dma_arg->rx_dma_ch;
    rx_dmaLliPPStruct.dmaCtrlRegVal = rx_dmaCtrlRegVal;
    rx_dmaLliPPStruct.DMA_LLI_Cfg = &rxllicfg;
    rx_dmaLliPPStruct.operatePeriphAddr = SPI_BASE + SPI_FIFO_RDATA_OFFSET;
    rx_dmaLliPPStruct.is_single_mode = DISABLE;
    rx_dmaLliPPStruct.chache_buf_addr[0] = (uint32_t)ping_buf;
    rx_dmaLliPPStruct.chache_buf_addr[1] = (uint32_t)pong_buf;
    
    memset(ping_buf, 0x00, len);
    memset(pong_buf, 0x00, len);

    /* dma lli pp struct steup */
    DMA_LLI_PpStruct_Init(&rx_dmaLliPPStruct);

    DMA_IntMask(rx_dmaLliPPStruct.dmaChan, DMA_INT_ALL, MASK);
    DMA_IntMask(rx_dmaLliPPStruct.dmaChan, DMA_INT_TCOMPLETED, UNMASK);
    DMA_IntMask(rx_dmaLliPPStruct.dmaChan, DMA_INT_ERR, UNMASK);

    /* Install the interrupt callback function */
    hosal_dma_irq_callback_set(dma_arg->rx_dma_ch, dma_rx_cb, arg);
    rx_dmaLliPPStruct.trans_index = 0; 
    pbuff = rx_buf_max;
    bl_irq_enable(DMA_ALL_IRQn);
    DMA_Enable();
    DMA_LLI_PpStruct_Start(&rx_dmaLliPPStruct);
	return 0;
}

static void spi_dma_handler_rx(void *arg, uint32_t flag)
{
    BaseType_t xResult = pdFAIL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    hosal_spi_dev_t *dev = (hosal_spi_dev_t *)arg;
    if (NULL != dev)
    {
        if (dev->config.dma_enable)
        {
            spi_dma_priv_t *priv=  (spi_dma_priv_t *)dev->priv;
            bl_dma_int_clear(priv->rx_dma_ch);

            if (SpiDataQueue != NULL)
            {
                uint8_t *buff;

                if (dma_irq_cnt == 0)
                {
                    buff = rx_ping_buf;
                    dma_irq_cnt = 1;
                }
                else
                {
                    buff = rx_pong_buf;
                    dma_irq_cnt = 0;
                }

                xResult = xQueueSendFromISR( SpiDataQueue, buff, &xHigherPriorityTaskWoken );
                if (xResult != pdFAIL)
                {
                    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
                }
            }
            else
            {
                printf("\r\nSpiDataQueue==null\r\n");
            }
        } 
    } 
    else 
    {
        printf("hosal_spi_int_handler_rx no clear isr.\r\n");
    }
}

static void bsp_spi_slave_init(void)
{
    if (sg_spi_enable != 0)
    {
        printf("spi already init\r\n");
        return;
    }

