Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
    spi_slave_cfg();

    memset(g_dataRecvBuf[0], 0, sizeof(g_dataRecvBuf[0]));

    int err = hosal_spi_dma_pp_recv(&spi, SPI_DMA_BUFF_LEN, rx_ping_buf, rx_pong_buf, spi_dma_handler_rx);
    if (err != 0)
    {
        printf("spi DMA init failed\r\n");
    }
}

static void *Radar_GetRadarParaAddr(void)
{
    // printf("InitRegList addr=%p\r\n", &InitRegList);
    return (void *)&InitRegList;
}

static uint32_t Radar_GetRadarParaLen(void)
{
    return sizeof(InitRegList);
}

static void System_ParaInit(void)
{
    sysPara.uploadSampleRate = UPLOAD_SAMPLE_RATE;
    sysPara.debugMode = DEBUG_MODE_DEFAULT;
}

static void *System_GetSysParaAddr(void)
{
    return (void *)&sysPara;
}

static uint32_t System_GetSysParaLen(void)
{
    return sizeof(sysPara);
}

static int bsp_nv_write(char *key, char *value, uint16_t val_len)
{
    int err;

    err = ef_set_env_blob(key, (void *)value, val_len);
    if (err != EF_NO_ERR)
    {
        printf("[NV] write key[%s] err\r\n", key);
    }

    return err;
}

static int bsp_nv_read(char *key, char *value, uint16_t val_len)
{
    size_t len = 0;

    ef_get_env_blob(key, (void *)value, val_len, &len);
    if (len < val_len)
    {
        printf("[NV] get fail:%d \r\n", len);
        return -1;
    }

    return 0;
}

static void Config_WriteData2Flash(void)
{
    uint16_t idx = 0;
    int err;

    flashData.magic = FLASH_MAGIC_NUM;

    err = bsp_nv_write(elem_key.magic, (char *)&flashData.magic, sizeof(flashData.magic));
    if (err != EF_NO_ERR)
    {
        printf("save magic failed\r\n");
    }

    for (idx = 0; idx < FLASH_ELEM_MAX; idx++)
    {
        bsp_nv_write(elem_key.elem_len[idx], (char *)&flashData.elem[idx].elemLen, sizeof(flashData.elem[idx].elemLen));
        bsp_nv_write(elem_key.elem_member[idx], (char *)flashData.elem[idx].elemAddr, flashData.elem[idx].elemLen/FLASH_WORD_LEN);
    }
}

void Config_RetrieveFlashData(void)
{
    uint16_t idx = 0;

    bsp_nv_read(elem_key.magic, (char *)&flashData.magic, sizeof(flashData.magic));
    printf("flashData.magic=%#x\r\n", flashData.magic);
    if (FLASH_MAGIC_NUM != flashData.magic)
    {
        printf("flash setting is empty!\r\n");
        Config_WriteData2Flash();               // 往flash写入数据
    }

    flashData.magic = 0;
    bsp_nv_read(elem_key.magic, (char *)&flashData.magic, sizeof(flashData.magic));
    if (FLASH_MAGIC_NUM != flashData.magic) // 写入失败擦除参数，死循环
    {
        printf("Error: flash work abnormal!\r\n");
    }
    
    for (idx = 0; idx < FLASH_ELEM_MAX; idx++)
    {
        bsp_nv_read(elem_key.elem_len[idx], (char *)&flashData.elem[idx].elemLen, sizeof(flashData.elem[idx].elemLen));
        printf("flashData.elem[%d].elemLen=%d\r\n", idx, flashData.elem[idx].elemLen);
        printf("flashData.elem[%d].elemAddr=%p\r\n", idx, flashData.elem[idx].elemAddr);
        bsp_nv_read(elem_key.elem_member[idx], (char *)flashData.elem[idx].elemAddr, flashData.elem[idx].elemLen/FLASH_WORD_LEN);
    }
	// Config_ReloadAlgoRegister(System_GetSysMode());             
}

static void Config_Init(void)
{
    uint16_t totalLen = 0;

    totalLen += sizeof(flashData.magic);
    
    flashData.elem[FLASH_ELEM_RADAR].elemAddr = Radar_GetRadarParaAddr();   // 获取雷达参数结构体数组地址
    flashData.elem[FLASH_ELEM_RADAR].elemLen = Radar_GetRadarParaLen();     // 获取结构体数组大小
    totalLen += flashData.elem[FLASH_ELEM_RADAR].elemLen + sizeof(flashData.elem[FLASH_ELEM_RADAR].elemLen);
    printf("flashData.elem[FLASH_ELEM_RADAR].elemAddr=%p\r\n", flashData.elem[FLASH_ELEM_RADAR].elemAddr);
    printf("flashData.elem[FLASH_ELEM_RADAR].elemLen=%d\r\n", flashData.elem[FLASH_ELEM_RADAR].elemLen);

    System_ParaInit();
    flashData.elem[FLASH_ELEM_SYS].elemAddr = System_GetSysParaAddr(); 
    flashData.elem[FLASH_ELEM_SYS].elemLen = System_GetSysParaLen();
    totalLen += flashData.elem[FLASH_ELEM_SYS].elemLen + sizeof(flashData.elem[FLASH_ELEM_SYS].elemLen);
    printf("flashData.elem[FLASH_ELEM_SYS].elemAddr=%p\r\n", flashData.elem[FLASH_ELEM_SYS].elemAddr);
    printf("flashData.elem[FLASH_ELEM_SYS].elemLen=%d\r\n", flashData.elem[FLASH_ELEM_SYS].elemLen);

    if (totalLen > FLASH_PAGE_SIZE)     // 1K
    {
        printf("Error: flashDataLen is more than FLASH_PAGE_SIZE!\r\n");
    }
	Config_RetrieveFlashData();         // flash有参数则读取参数，无参数则写入参数
}

static uint16_t FillCmdAck(const uint16_t *data, uint16_t dataLen, uint16_t cmdType, uint16_t status)
{
    uint16_t index = 0;

    if (dataLen * sizeof(uint16_t) > (CMD_LEN_MAX - CMD_OVERHEAD_LEN))
    {
        return 0;
    }
    
	memcpy(&CmdAck[index], CmdHead, sizeof(CmdHead));
    index += sizeof(CmdHead);

    if (data == NULL)
    {
        *((uint16_t*)(&CmdAck[index])) = CMD_TYPE_LEN + CMD_STATUS_LEN;
    }
	else if(masterProtocolVer != 0)
    {
        #if (RADAR_PROTOCOL_VERSION == 1)
        /* 协议版本1, 协议长度 = command length + ack length + data length */
        *((uint16_t*)(&CmdAck[index])) = CMD_TYPE_LEN + CMD_STATUS_LEN + (dataLen * sizeof(uint16_t));
        #elif (RADAR_PROTOCOL_VERSION == 2)
        /* 协议版本2 */
        /* Read version command */
        if(READ_VER_CMD == cmdType)
        {
            /* 协议长度 = command length + ack length + command string length + data length word legnth */
            *((uint16_t*)(&CmdAck[index])) = CMD_TYPE_LEN + CMD_STATUS_LEN + CMD_STR_LEN + dataLen;
        }
        else
        {
            /* 协议长度 = command length + ack length + data length */
            *((uint16_t*)(&CmdAck[index])) = CMD_TYPE_LEN + CMD_STATUS_LEN + (dataLen * sizeof(uint16_t));
        }
        #endif
    }
    else
    {
        *((uint16_t*)(&CmdAck[index])) = CMD_TYPE_LEN + (dataLen * sizeof(uint16_t));
    }
    index += sizeof(uint16_t);
    
    *((uint16_t*)(&CmdAck[index])) = cmdType | CMD_ACK_TYPE;
    index += sizeof(uint16_t);
    
	if(masterProtocolVer != 0 || data == NULL)
	{
		if(masterProtocolVer == 0)
		{
			status = (status == ACK_OK) ? ACK_OK_OLD : ACK_FAIL_OLD;
		}
		*((uint16_t*)(&CmdAck[index])) = status;
		index += sizeof(uint16_t);
	}
	
    if (data != NULL)
    {
        if((RADAR_PROTOCOL_VERSION == 2) && (READ_VER_CMD == cmdType))
        {
            *((uint16_t*)(&CmdAck[index])) = dataLen;
            index += sizeof(uint16_t);
            memcpy(&CmdAck[index], data, dataLen);
            index += dataLen;
        }
        else
        {
            memcpy(&CmdAck[index], data, dataLen*sizeof(uint16_t));
            index += dataLen * sizeof(uint16_t);
        } 
    }

	memcpy(&CmdAck[index], CmdTail, sizeof(CmdTail));
    index += sizeof(CmdTail);
    
	return index;
}

static void Config_SavePara2Flash(void)
{    
    if (!needFlashWrite)
    {
        return;
    }

    Config_WriteData2Flash();
    needFlashWrite = 0;
}

static uint8_t DataProc_NeedReconfig(void)
{
    uint8_t channel = 0;
    uint8_t needReconfig = 0;
    RADAR_PARA_T radarParaTmp = {0};
    
    if (0 != GetRadarPara(&radarParaTmp))
    {
        printf("\r\nGetRadarPara failed!\r\n");
    }

    RadarPara.chirpNum = radarParaTmp.chirpNum;
    if ((radarParaTmp.dataType != RadarPara.dataType) || (radarParaTmp.dataLen != RadarPara.dataLen))
    {
        needReconfig = 1;
        RadarPara.dataType = radarParaTmp.dataType;
        RadarPara.dataLen = radarParaTmp.dataLen;
    }
	
