Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
	memset(&RadarDataParse, 0 ,sizeof(RadarDataParse));
	for (channel = 0; channel < 1; channel++)
	{
		RadarDataParse[channel].needCopyLen = RadarPara.dataLen - SPI_FRAME_HLEN - SPI_FRAME_TLEN;
	}
	
    return needReconfig;
}

static void System_Reconfig(void)
{
    // printf("befoer deinit spi\r\n");
    bsp_spi_deinit();
    // printf("after deinit spi\r\n");
    // vTaskDelay(pdMS_TO_TICKS(1));

	DataProc_NeedReconfig();
    // printf("befoer init spi\r\n");
    bsp_spi_slave_init();
    // printf("after init spi\r\n");
}

static void Config_NeedFlashWrite(void)
{
    needFlashWrite = 1;
}

static void Radar_UpdateReg(uint16_t addr, uint16_t val)/*currently only update existing reg*/
{
    uint16_t loop = 0;

    while(InitRegList[loop].addr) 
    {   
        if (loop < REG_FIX_NUM)
        {
            loop++;
            continue;
        }
        
        if (InitRegList[loop].addr == addr)
        {
            InitRegList[loop].val = val;
            Config_NeedFlashWrite();
            return;
        }
        loop++;
    }
}

static uint16_t DoWriteReg(CMD_T *cmd, uint32_t cmdLen)
{
    uint16_t ackLen = 0;
    uint16_t status = ACK_OK;
    uint16_t regNum = 0;
    uint16_t loop = 0;
    uint16_t regVal = 0;
	uint16_t devAddress = I2C_ADDR_BanYan_Chip0;
    CMD_REG_T *cmdReg = NULL;

    if (NULL == cmd || 0 == cmdLen)
    {
        return 0;
    }
        
	if (CmdModeFlag) 
    {
		devAddress = cmd->cmdData[0] << 1;
		regNum = (cmdLen - CMD_TYPE_LEN - CMD_DEV_ADDR_LEN) / sizeof(CMD_REG_T);
		for (loop = 0; loop < regNum; loop++) 
        {
            cmdReg = (CMD_REG_T*)((uint8_t*)(cmd->cmdData) + CMD_DEV_ADDR_LEN + (loop * sizeof(CMD_REG_T)));
            rd01_iic_write(devAddress, (uint8_t)(cmdReg->addr), cmdReg->val);
			if(devAddress == I2C_ADDR_BanYan_Chip0)
			{
                //update master register
				Radar_UpdateReg(cmdReg->addr, cmdReg->val);
			}

            rd01_iic_read(devAddress, (uint8_t)(cmdReg->addr), &regVal);
			if (regVal != cmdReg->val) 
            {
				status = ACK_FAIL;
			}
		}
	} 
    else 
    {
		status = ACK_FAIL;
	}
    
    ackLen = FillCmdAck(NULL, 0, cmd->cmdType, status);
    
    return ackLen;
}

static uint16_t DoReadReg(CMD_T *cmd, uint32_t cmdLen)
{
    uint16_t ackLen = 0;
    uint16_t status = ACK_OK;
    uint16_t regNum = 0;
    uint16_t loop = 0;
    uint16_t *readBuf = NULL;
	uint16_t devAddress = I2C_ADDR_BanYan_Chip0;
	
    if (NULL == cmd || 0 == cmdLen)
    {
        return 0;
    }
        
    if (CmdModeFlag) 
    {
		devAddress = cmd->cmdData[0] << 1;
        regNum = (cmdLen - CMD_TYPE_LEN - CMD_DEV_ADDR_LEN) / CMD_REG_ADDR_LEN;
        
        if (regNum > CMD_REG_MAX)
        {
			regNum = 0;
            status = ACK_FAIL;
        }
        else
        {
			uint16_t dataIndex = (masterProtocolVer != 0) ? CMD_DATA_POS : CMD_DATA_POS_OLD;
            readBuf = (uint16_t*)(&CmdAck[dataIndex]);
            for (loop = 0; loop < regNum; loop++) 
            {
				uint16_t regVal = 0;
                rd01_iic_read(devAddress, (uint8_t)(cmd->cmdData[loop + 1]), &regVal);
				readBuf[loop] = regVal;
            }
        }   
    } 
    else 
    {
        status = ACK_FAIL;
    }
    
    ackLen = FillCmdAck(readBuf, regNum, cmd->cmdType, status);

    return ackLen;
}

int8_t System_ParaUpdate(uint16_t type, int32_t val)
{
    switch (type)  
    {
       case SYS_DEBUG_MODE:
            sysPara.debugMode = (int16_t)val;
            break;
        
        default:
            return -1;
    }

    return 0;
}

int8_t NopCofig_ParaUpdate(uint16_t type, int32_t val)
{
    switch (type)  
    {
		case NOPCONFIG_ENABLE:
			enableNopConfig = (int8_t)val;
			nopConfigStartRegisterIndex = 0;
			nopConfigStopRegisterIndex = 0;
			//printf("enablenopreg:%d\r\n", enableNopConfig);
			break;
		case NOPCONFIG_STARTTIME:
			nopConfigStartMs = (uint16_t)val;
			//printf("starttime:%d\r\n", nopConfigStartMs);
			break;
		case NOPCONFIG_STOPTIME:
			nopConfigStopMs = (uint16_t)val;
			//printf("stoptime:%d\r\n", nopConfigStopMs);
			break;
		case NOPCONFIG_STARTREGISTER:
			nopConfigStartRegister[nopConfigStartRegisterIndex++] = val;
			//printf("NOPCONFIG_STARTREGISTER:%x\r\n", val);
			break;
		case NOPCONFIG_STOPREGISTER:
			nopConfigStopRegister[nopConfigStopRegisterIndex++] = val;
			//printf("NOPCONFIG_STOPREGISTER:%x\r\n", val);
			break;        
        default:
            return -1;
    }
    return 0;
}

static uint16_t DoWritePara(CMD_T *cmd, uint32_t cmdLen)
{
    uint16_t ackLen = 0;
    uint16_t status = ACK_OK;
    uint16_t paraNum = 0;
    uint16_t loop = 0;
    CMD_PARA_T *cmdPara = NULL;
    int8_t ret = 0;

    if (NULL == cmd || 0 == cmdLen)
    {
        return 0;
    }
        
	if (CmdModeFlag) 
    {
		paraNum = (cmdLen - CMD_TYPE_LEN) / sizeof(CMD_PARA_T);
		for (loop = 0; loop < paraNum; loop++) 
        {
            cmdPara = (CMD_PARA_T*)((uint8_t*)(cmd->cmdData) + (loop * sizeof(CMD_PARA_T)));
            switch (cmd->cmdType)
            {
                case WRITE_MTT_CMD: 
                    // ret = MTT_ParaUpdate(cmdPara->type, cmdPara->val);
                    ret = -1;
                    break;

                case WRITE_SYS_CMD: 				
                    ret = System_ParaUpdate(cmdPara->type, cmdPara->val);
                    break;
                case FFT_ZEROFILL_CMD:
					// ret = fftzerofill_ParaUpdate(cmdPara->type, cmdPara->val);
                    ret = -1;
					break;
				case NOP_CONFIG_CMD:
					ret = NopCofig_ParaUpdate(cmdPara->type, cmdPara->val);
					break;
                default:
                    ret = -1;
                    break;
            }
            if (ret)
            {
                status = ACK_FAIL;
            }
			else
			{
				Config_NeedFlashWrite();
			}
		}
	} 
    else 
    {
		status = ACK_FAIL;
	}
    
    ackLen = FillCmdAck(NULL, 0, cmd->cmdType, status);
    
    return ackLen;
}

int32_t MTT_ParaRead(uint16_t type)
{
    return 0x7fffffff; /*invalid value*/
}

int32_t System_ParaRead(uint16_t type)
{
    switch (type)  
    {
        case SYS_SYSTEM_MODE:
            return sysPara.systemMode;

        case SYS_UPLOAD_SP_RATE:
            return sysPara.uploadSampleRate;

       case SYS_DEBUG_MODE:
            return sysPara.debugMode;

        default:
            return 0x7fffffff; /*invalid value*/
    }
}

static uint16_t DoReadPara(CMD_T *cmd, uint32_t cmdLen)
{
    uint16_t ackLen = 0;
    uint16_t status = ACK_OK;
    uint16_t paraNum = 0;
    uint16_t loop = 0;
    uint32_t *readBuf = NULL;

