Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
    if (NULL == cmd || 0 == cmdLen)
    {
        return 0;
    }
        
    if (CmdModeFlag) 
    {
        paraNum = (cmdLen - CMD_TYPE_LEN) / CMD_PARA_NAME_LEN;
        
        if (paraNum > CMD_PARA_MAX)
        {
			paraNum = 0;
            status = ACK_FAIL;
        }
        else
        {
			uint16_t dataIndex = (masterProtocolVer != 0) ? CMD_DATA_POS : CMD_DATA_POS_OLD;
            readBuf = (uint32_t*)(&CmdAck[dataIndex]);
            for (loop = 0; loop < paraNum; loop++) 
            {
                switch (cmd->cmdType)
                {
                    case READ_MTT_CMD:
                        readBuf[loop] = MTT_ParaRead(cmd->cmdData[loop]);
                        break;
                    
                    case READ_SYS_CMD:
                        readBuf[loop] = System_ParaRead(cmd->cmdData[loop]);
                        break;
                    
                    default:
                        break;
                }
            }
        }   
    } 
    else 
    {
        status = ACK_FAIL;
    }
    
    ackLen = FillCmdAck((uint16_t*)readBuf, paraNum*2, cmd->cmdType, status);
    
    return ackLen;
}

uint32_t Config_GetSN(void)
{
    return 0xffffffff;
}

static uint16_t DoReadSn(CMD_T *cmd)
{
    uint16_t ackLen = 0;
    uint16_t status = ACK_OK;
    uint16_t sn[SN_LEN] = {0};

    if (NULL == cmd)
    {
        return 0;
    }
        
    if (CmdModeFlag) 
    {   
        sn[0] = RADAR_DEV_MODEL_TYPE_SN;
        *(uint32_t*)(&sn[1]) = Config_GetSN();      
    } 
    else 
    {
        status = ACK_FAIL;
    }
    
    ackLen = FillCmdAck(sn, sizeof(sn), cmd->cmdType, status);
    return ackLen;
}

uint16_t DoConfigurePara(CMD_T *cmd, uint32_t cmdLen)
{
    uint16_t ackLen = 0;
    uint16_t range_bin;
    uint8_t i;
    ALGORITHM_PARAM_T tempParam = gAlgorithmParam;
    
    /* Note: the transfer data is merged by ID and DATA. The ID is 6bits and DATA is 32bits,
             PARAM_CFG_CMD(0x0060) protocol: cmd->cmdData[0] is MaxMotinRangeBinID(16bits)
                                             cmd->cmdData[1] is MaxMotinRangeBin(32bits) 
                                             cmd->cmdData[3] is MaxMotinRangeLessBinID(16bits)
                                             cmd->cmdData[4] is MaxMotinRangeLessBin(32bits)
                                             cmd->cmdData[6] is OFF_TimeID(16bits)
                                             cmd->cmdData[7] is OFF_Time(32bits)
                     
             THRESHOLD_SET_CMD(0x0064) proyocol: cmd->cmdData[0] is RangeBinID(16bits)
                                            cmd->cmdData[1] is RangeBin(32bits) 
                                            cmd->cmdData[3] is MotionThresholdID(16bits)
                                            cmd->cmdData[4] is MotionThreshold(32bits) 
                                            cmd->cmdData[6] is MotionLessThresholdID(16bits) 
                                            cmd->cmdData[7] is MotionLessThreshold(32bits),
                                            if RangeBin value is 0xFFFF, Then the threshold is for all Bins. 
     */
    
    /* Radar must be in cmd mode */
    if(0 == CmdModeFlag)
    {
        // clearCmdHeadFlag();
        goto ACK_FAIL_RETURN; 
    }
    /* config RangeBin threshold cmd */
    if(THRESHOLD_SET_CMD == cmd->cmdType)
    {
        /* check paras ID */
        if(0x0000 != cmd->cmdData[0] || 0x0001 != cmd->cmdData[3] || 0x0002 != cmd->cmdData[6])
        {
            goto ACK_FAIL_RETURN;
        }

         range_bin =  cmd->cmdData[1];
         /* range bin is out of range */
        if((0xFFFF != range_bin) && (range_bin > ONEFFT_POINT-2))
        {
            goto ACK_FAIL_RETURN;
        } 

        /* config all range bins threshold */
        if(0xFFFF == range_bin)
        {
            for(i = 0; i < ONEFFT_POINT-1 ; i++)
            {
                 tempParam.nThresholdValOfMotion[i] = (uint32_t)(cmd->cmdData[4]);
                 tempParam.nThresholdValOfMotionLess[i] = (uint32_t)(cmd->cmdData[7]);
            }
        }
        /* config sigle bin threshold */
        else
        {
            tempParam.nThresholdValOfMotion[range_bin] = (uint32_t)(cmd->cmdData[4]);
            tempParam.nThresholdValOfMotionLess[range_bin] = (uint32_t)(cmd->cmdData[7]);
        }
    }
    /* config max range bin and off time cmd */
    else if(PARAM_CFG_CMD == cmd->cmdType)
    {
         /* check para ID */
        if(0x0000 != cmd->cmdData[0] || 0x0001 != cmd->cmdData[3] || 0x0002 != cmd->cmdData[6])
        {
            goto ACK_FAIL_RETURN;
        }

        tempParam.nMaxMotionRangeBin = cmd->cmdData[1] ;
        tempParam.nMaxMotionLessRangeBin = cmd->cmdData[4];
        tempParam.nOffTime = cmd->cmdData[7];
    }

    /* is some differences between new para with old para */
    if (memcmp((void*)(&gAlgorithmParam), (void*)(&tempParam), sizeof(ALGORITHM_PARAM_T)) != 0)
    {
        memcpy((void*)(&gAlgorithmParam), (void*)(&tempParam), sizeof(ALGORITHM_PARAM_T));
        Algo_SaveParameter((uint32_t *)&gAlgorithmParam, sizeof(ALGORITHM_PARAM_T));
    }

    ackLen = FillCmdAck(NULL, 2, cmd->cmdType, ACK_OK); 
    return ackLen;

ACK_FAIL_RETURN:
    ackLen = FillCmdAck(NULL, 2, cmd->cmdType, ACK_FAIL);
    return ackLen;
}

static uint16_t DoReadConfigureParam(CMD_T *cmd, uint32_t cmdLen)
{
    uint16_t ackLen = 0;
    uint8_t i;
    uint8_t pos = 0;

    union
    {
       uint8_t  tx_buf_u8[6 + (ONEFFT_POINT-1)  * 2];
       uint16_t tx_buf_u16[3 +(ONEFFT_POINT-1) ];
		
    }Buf;

    /* Radar must be in cmd mode */
    if((0 == CmdModeFlag)/* && (0 == g_axk_ble_radar_cfg.get_cmd_mode_flag()) */)
    {
        // clearCmdHeadFlag();
        ackLen = FillCmdAck(Buf.tx_buf_u16, sizeof(Buf.tx_buf_u16)/sizeof(Buf.tx_buf_u16[0]), cmd->cmdType, ACK_FAIL);
        return ackLen;
    }
    /* fill ack data */
    Buf.tx_buf_u8[pos++] = 0xAA;
    Buf.tx_buf_u8[pos++] = ONEFFT_POINT - 1-1;
    Buf.tx_buf_u8[pos++] = (uint8_t)gAlgorithmParam.nMaxMotionRangeBin;
    Buf.tx_buf_u8[pos++] = (uint8_t)gAlgorithmParam.nMaxMotionLessRangeBin;
    for(i = 0; i < ONEFFT_POINT-1 ; i++)
    {
        Buf.tx_buf_u8[pos++] = gAlgorithmParam.nThresholdValOfMotion[i];
    }

