Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
    for(i = 0; i < ONEFFT_POINT-1 ; i++)
    {
        Buf.tx_buf_u8[pos++] = gAlgorithmParam.nThresholdValOfMotionLess[i];
    }

    *(uint16_t*)&Buf.tx_buf_u8[pos] = gAlgorithmParam.nOffTime ;

    ackLen = FillCmdAck(Buf.tx_buf_u16, sizeof(Buf.tx_buf_u16)/sizeof(Buf.tx_buf_u16[0]), cmd->cmdType, ACK_OK); 
    return ackLen;
}

static uint16_t DoCascadingMode(CMD_T *cmd, uint32_t cmdLen)
{
    uint16_t ackLen = 0;
    uint16_t status = ACK_OK;

    if (NULL == cmd || 0 == cmdLen)
    {
        return 0;
    }

    ackLen = FillCmdAck(NULL, 0, cmd->cmdType, status);

    return ackLen;
}

static uint16_t StartI2CTest(CMD_T *cmd, uint32_t cmdLen)
{
    uint16_t ackLen = 0;
    uint16_t status = ACK_OK;
	
    if (NULL == cmd || 0 == cmdLen)
    {
        return 0;
    }

    ackLen = FillCmdAck(NULL, 0, cmd->cmdType, status);
    return ackLen;
}

static uint16_t StopI2CTest(CMD_T *cmd, uint32_t cmdLen)
{
	uint16_t ackLen = 0;
    uint16_t status = ACK_OK;

    ackLen = FillCmdAck(NULL, 0, cmd->cmdType, status);
	return ackLen;	
}

static uint16_t GetI2CTestResult(CMD_T *cmd, uint32_t cmdLen)
{
	uint16_t ackLen = 0;
	uint16_t status = ACK_OK;
	uint8_t buf[10] = {0};

	ackLen = FillCmdAck((uint16_t*)buf, 5, cmd->cmdType, status);
	return ackLen;
}

static void CmdExec(CMD_T *cmd, uint32_t cmdLen)
{
    // CMD_REG_T *cmdReg = NULL;
    uint16_t  ackLen = 0;
    uint16_t status = ACK_OK;
    uint16_t temp_result = 0;
    int ret;

    char *str = "v1.0.0";

    if (NULL == cmd || 0 == cmdLen)
    {
        return;
    }

    printf("cmd->cmdType=0X%04X\r\n", cmd->cmdType);

	switch(cmd->cmdType)
    {
		 /* Enable debug mode, Send all rangebin mag to PC */
        case ENABLE_DEBUG_CMD:
            if(1 == CmdModeFlag)
            {
                DebugModeFlag = 1;
                ackLen = FillCmdAck(NULL, 0, cmd->cmdType, ACK_OK);
            }
            break;

            /* Disable debug mode, only send target information to PC */
        case DISABLE_DEBUG_CMD:
            if(1 == CmdModeFlag)
            {
                ackLen = FillCmdAck(NULL, 0, cmd->cmdType, ACK_OK);
                DebugModeFlag = 0;
            }
            break;

		case START_CFG_CMD:
            printf("start cfg\r\n");
			CmdModeFlag = 1;

			if(cmdLen > CMD_TYPE_LEN)
			{
				start_cfg_ack[0] = RADAR_PROTOCOL_VERSION;;
				start_cfg_ack[1] = CMD_LEN_MAX;
				
				masterProtocolVer = cmd->cmdData[0];
				ackLen = FillCmdAck(start_cfg_ack, ARRAY_SIZE(start_cfg_ack), cmd->cmdType, ACK_OK);
			}
			else
			{
				masterProtocolVer = 0;
				ackLen = FillCmdAck(NULL, 0, cmd->cmdType, ACK_OK);
			}
		    break;
        
		case FINISH_CFG_CMD:
            printf("finish cfg\r\n");
			ackLen = FillCmdAck(NULL, 0, cmd->cmdType, ACK_OK);

            if (g_FtcmdFlag == 0)   //非产测模式
            {
                if (CmdModeFlag != 0)
                {
                    Config_SavePara2Flash();
                    System_Reconfig();
                }
                else
                {
                    ackLen = 0;
                }
            }
		    break;
            
		case WRITE_REG_CMD:
            ackLen = DoWriteReg(cmd, cmdLen);
		    break;
            
		case READ_REG_CMD:
            ackLen = DoReadReg(cmd, cmdLen);
		    break;
            
		case READ_VER_CMD:
            printf("read version\r\n");
			if(masterProtocolVer != 0)
			{
                #if (RADAR_PROTOCOL_VERSION == 1)
                ackLen = FillCmdAck(read_ver_ack, ARRAY_SIZE(read_ver_ack), cmd->cmdType, ACK_OK);
                #elif (RADAR_PROTOCOL_VERSION == 2)
                ackLen = FillCmdAck((uint16_t *)str, strlen(str), cmd->cmdType, ACK_OK);
                #endif
			}
			else
			{
				ackLen = FillCmdAck(&read_ver_ack[2], ARRAY_SIZE(read_ver_ack) - 2 , cmd->cmdType, ACK_OK);
			}
            
            break;
        
		case WRITE_MTT_CMD:
        case WRITE_SYS_CMD:
		case FFT_ZEROFILL_CMD:
		case NOP_CONFIG_CMD:
            ackLen = DoWritePara(cmd, cmdLen);
		    break;

        case READ_MTT_CMD:
        case READ_SYS_CMD:
            ackLen = DoReadPara(cmd, cmdLen);
		    break;
        
        case READ_SN_CMD:
            ackLen = DoReadSn(cmd);
		    break;
		
		 /* config para */
        case PARAM_CFG_CMD: 
        case THRESHOLD_SET_CMD:

            ackLen = DoConfigurePara(cmd, cmdLen);
            break;

        /* Read all para */
        case PARAM_READ_CMD: 

            ackLen = DoReadConfigureParam(cmd, cmdLen);
           break;
		
		case CASCADING_MODE_CMD:
			ackLen = DoCascadingMode(cmd, cmdLen);
            break;
		
		case START_I2C_TEST_CMD:
			ackLen = StartI2CTest(cmd, cmdLen);
            break;
		
		case STOP_I2C_TEST_CMD:
			ackLen = StopI2CTest(cmd, cmdLen);
            break;
        
		case GET_I2C_TEST_RESULT_CMD:
			ackLen = GetI2CTestResult(cmd, cmdLen);
            break;
		case RADAR_TO_AT_MODE_CMD:
            if (CmdModeFlag != 0)
            {
                if (cmdLen != 4)
                {
                    ackLen = FillCmdAck(NULL, 0, cmd->cmdType, ACK_FAIL);
                }
                else
                {
                    if (cmd->cmdData[0] == 0x0001)
                    {
                        //保存flash
                        char cmd_mode = 1;
                        bsp_nv_write(RADAR_AT_MODE_KET, &cmd_mode, sizeof(cmd_mode));
                    }
                    ackLen = FillCmdAck(NULL, 0, cmd->cmdType, ACK_OK);
                }
            }
            break;
    #if RADAR_FACTORY_ENABLE
		case ENTER_FACTORYMODE_CMD:     // 进产测
            printf("\r\nenter factory!\r\n\r\n");
            if(1 == CmdModeFlag)
            {
                status = ACK_OK;
            }
            else
            {
                status = ACK_FAIL;
            }
            
            ft_create_queue_and_task();
            Ft_System_Reconfig();

            g_FtcmdFlag =  1;
            /* Factory test command ack buffer */
            uint16_t  FT_ack[7] = {0x00, 0x01, 0x01, 0x00, 0x08, 0x08, 0x08};
			ackLen = FillCmdAck(FT_ack, ARRAY_SIZE(FT_ack), cmd->cmdType, status);
			break;
		
		case EXIT_FACTORYMODE_CMD:      // 退出产测
            if(1 == CmdModeFlag)
            {
                status = ACK_OK;
            }
            else
            {
                status = ACK_FAIL;
            }

            g_FtcmdFlag = 0;

            //写产测结果,后续AMPS通过检测结果判断雷达有无进行过产测,1为通过，0为失败
            printf("\r\nexit factory\r\n\r\n");
            printf("result: %d, len(%d)\r\n", cmd->cmdData[0], cmdLen);
            bsp_nv_write(FACTORY_RESULT_KEY, (char *)&cmd->cmdData[0], 2);

			ackLen = DoExitFactoryMode(cmd, cmdLen);
			break;
        
        case AMPS_READ_RESULT: //获取产测结果指令
            // FD FC FB FA 02 00 A1 00 04 03 02 01
            CmdModeFlag = 1;        // 不让串口输出信息
            printf("AMPS read result!\r\n");
            ret = bsp_nv_read(FACTORY_RESULT_KEY, (char *)&temp_result, sizeof(temp_result));
            if (ret != 0)
            {
                printf("AMPS read result failed!\r\n");
            #if USER_UART_ENABLE
                uart_dma_send((uint8_t *)"\r\nRESULT FAILED\r\n", strlen("\r\nRESULT FAILED\r\n"));
            #endif

                if (cmd_ack_cb)
                {
                    cmd_ack_cb((uint8_t *)"\r\nRESULT FAILED\r\n", strlen("\r\nRESULT FAILED\r\n"));
                }
            }
            else
            {
                printf("AMPS read result:%d\r\n", temp_result);

            #if USER_UART_ENABLE
                while(1 == g_uartDmaSendingFlag){}
                g_uartDmaSendingFlag = 1;
            #endif

                if (temp_result == 1)
                {
                #if USER_UART_ENABLE
                    uart_dma_send((uint8_t *)"\r\nRESULT OK\r\n", strlen("\r\nRESULT OK\r\n"));
                #endif

                    if (cmd_ack_cb)
                    {
                        cmd_ack_cb((uint8_t *)"\r\nRESULT OK\r\n", strlen("\r\nRESULT OK\r\n"));
                    }
                }
                else
                {
                #if USER_UART_ENABLE
                    uart_dma_send((uint8_t *)"\r\nRESULT FAILED\r\n", strlen("\r\nRESULT FAILED\r\n"));
                #endif

                    if (cmd_ack_cb)
                    {
                        cmd_ack_cb((uint8_t *)"\r\nRESULT FAILED\r\n", strlen("\r\nRESULT FAILED\r\n"));
                    }
                }
            }
            CmdModeFlag = 0;

            break;
    #endif//RADAR_FACTORY_ENABLE

		default:
            printf("unknown cmd\r\n");
		    break;
	}
	
    if (ackLen > 0)
    {
    #if USER_UART_ENABLE
        while(1 == g_uartDmaSendingFlag){}
        g_uartDmaSendingFlag = 1;
        uart_dma_send(CmdAck, ackLen);
        // printf("ack:");
        // for (size_t i = 0; i < ackLen; i++)
        // {
        //     printf("%02x ",CmdAck[i]);
        // }
        // printf("\r\n");
    #endif //USER_UART_ENABLE

        if (cmd_ack_cb)
        {
            cmd_ack_cb(CmdAck, ackLen);
        }

		if(cmd->cmdType == FINISH_CFG_CMD)
		{
			CmdModeFlag = 0;
		}
    }
}

void aiio_radar_cmd_process(uint8_t* buf, uint16_t len)
{
    uint16_t loop = 0;

    if (NULL == buf || 0 == len)
    {
        return;
    }

    // printf("recvLen:%d\r\n", len);
    // for (int i = 0; i < len; i++)
    // {
    //     printf("0x%02x ", buf[i]);
    // }
    // printf("\r\n");

	for (loop = 0; loop < len; loop++) 
    {
		switch(CmdDataParse.state)
		{                    
			case CMD_STATE_HEAD0:
				if (buf[loop] == CmdHead[CMD_HEAD_0]) 
                {
                    CmdDataParse.curIndex = 0;
					CmdDataParse.state = CMD_STATE_HEAD1;
				}
				break;
                
			case CMD_STATE_HEAD1:
				if (buf[loop] == CmdHead[CMD_HEAD_1])
                {
                    CmdDataParse.state = CMD_STATE_HEAD2;
				}
                else
                {
                    CmdDataParse.state = CMD_STATE_HEAD0;
                }
				break;

            case CMD_STATE_HEAD2:
				if (buf[loop] == CmdHead[CMD_HEAD_2])
                {
                    CmdDataParse.state = CMD_STATE_HEAD3;
				}
                else
                {
                    CmdDataParse.state = CMD_STATE_HEAD0;
                }
				break;

