Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
            case CMD_STATE_HEAD3:
				if (buf[loop] == CmdHead[CMD_HEAD_3])
                {
                    CmdDataParse.state = CMD_STATE_LEN0;
				}
                else
                {
                    CmdDataParse.state = CMD_STATE_HEAD0;
                }
				break;

            case CMD_STATE_LEN0:
                CmdDataParse.len = buf[loop];
                CmdDataParse.state = CMD_STATE_LEN1;
				break;

            case CMD_STATE_LEN1:
                CmdDataParse.len += buf[loop] << CMD_LEN_HIGH_POS;
                if (CmdDataParse.len <= CMD_BUF_LEN)
                {
                    CmdDataParse.state = CMD_STATE_DATA;
                }
                else
                {
                    CmdDataParse.state = CMD_STATE_HEAD0;
                }
				break;
                
            case CMD_STATE_DATA:
                CmdDataParse.buf[CmdDataParse.curIndex++] = buf[loop];
				if (CmdDataParse.curIndex == CmdDataParse.len)
                {
					CmdDataParse.state = CMD_STATE_TAIL0;
				}
				break;
                
            case CMD_STATE_TAIL0:
				if (buf[loop] == CmdTail[CMD_TAIL_0])
                {
                    CmdDataParse.state = CMD_STATE_TAIL1;
				}
                else
                {
                    CmdDataParse.state = CMD_STATE_HEAD0;
                }
				break;

            case CMD_STATE_TAIL1:
				if (buf[loop] == CmdTail[CMD_TAIL_1])
                {
                    CmdDataParse.state = CMD_STATE_TAIL2;
				}
                else
                {
                    CmdDataParse.state = CMD_STATE_HEAD0;
                }
				break;
                
            case CMD_STATE_TAIL2:
				if (buf[loop] == CmdTail[CMD_TAIL_2])
                {
                    CmdDataParse.state = CMD_STATE_TAIL3;
				}
                else
                {
                    CmdDataParse.state = CMD_STATE_HEAD0;
                }
				break;

            case CMD_STATE_TAIL3:
				if (buf[loop] == CmdTail[CMD_TAIL_3])
                {
                    CmdExec((CMD_T*)(CmdDataParse.buf), CmdDataParse.len);  
				}
                CmdDataParse.state = CMD_STATE_HEAD0;
				break; 
			
			default:
				CmdDataParse.state = CMD_STATE_HEAD0;
				break;

		}
	}
}

static void CmdProc_Recv(void)
{
    if (!g_cmdRecv.cmdReady)
    {
        return;
    }

    aiio_radar_cmd_process(g_cmdRecv.buf[g_cmdRecv.bufProc], g_cmdRecv.bufLen);

    g_cmdRecv.cmdReady = 0;
}

static void cmd_process_task(void *param)
{
    EventBits_t uxBits;

    for (;;)
    {
        uxBits = xEventGroupWaitBits(CmdProcessEventGroup, CMD_PROCESS_BIT, pdTRUE, pdFALSE, portMAX_DELAY);
        
        if( ( uxBits & CMD_PROCESS_BIT ) != 0 )
        {
            CmdProc_Recv();
        }
    }
}

static uint32_t Config_ReadAlgorithmParamLen(void)
{
    int ret;
    uint32_t dataLen = 0xffffffff;

    ret = bsp_nv_read(elem_key.bodysensing, (char *)&dataLen, sizeof(dataLen));
    if (ret != 0)
    {
        dataLen = 0xffffffff;
        printf("read dataLen failed\r\n");
    }
    
    return dataLen;   
}

static uint32_t Algo_ReadParameterExistFlag(void)
{
    uint32_t bParamExistFlag = Config_ReadAlgorithmParamLen();
    return bParamExistFlag;
}

static void Algo_ReadParameter(uint32_t *buf, uint32_t bufLen)
{
    bsp_nv_read(elem_key.parameter, (char *)buf, (uint16_t)bufLen);
}

static void Config_WritebodysensingFlash(uint32_t* addr, uint16_t len)
{
    uint32_t dataLen = len;

    bsp_nv_write(elem_key.bodysensing, (char *)&dataLen, sizeof(dataLen));
    bsp_nv_write(elem_key.parameter, (char *)addr, len);
}

static void Algo_SaveParameter(uint32_t*data,uint16_t len)
{
    Config_WritebodysensingFlash((uint32_t*)data, len);
}

static void InitAlgorithmParam(void)
{

    /* Read old paras from flash, if there no paras, then set them default */
    if (Algo_ReadParameterExistFlag() != 0xffffffff)    // 读取flash判断是否有保存值
    {
        // 读取数据
        printf("read nv parameter\r\n");
        Algo_ReadParameter((uint32_t *)&gAlgorithmParam, sizeof(ALGORITHM_PARAM_T));
        printf("gAlgorithmParam.nMaxMotionLessRangeBin=%d\r\n", gAlgorithmParam.nMaxMotionLessRangeBin);
        printf("ggAlgorithmParam.nMaxMotionRangeBin=%d\r\n", gAlgorithmParam.nMaxMotionRangeBin);
        printf("gAlgorithmParam.nThresholdValOfMotion[0]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[0]);
        printf("gAlgorithmParam.nThresholdValOfMotion[1]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[1]);
        printf("gAlgorithmParam.nThresholdValOfMotion[2]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[2]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[2]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[2]);
        printf("gAlgorithmParam.nThresholdValOfMotion[3]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[3]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[3]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[3]);
        printf("gAlgorithmParam.nThresholdValOfMotion[4]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[4]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[4]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[4]);
        printf("gAlgorithmParam.nThresholdValOfMotion[5]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[5]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[5]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[5]);
        printf("gAlgorithmParam.nThresholdValOfMotion[6]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[6]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[6]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[6]);
        printf("gAlgorithmParam.nThresholdValOfMotion[7]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[7]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[7]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[7]);
        printf("gAlgorithmParam.nThresholdValOfMotion[8]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[8]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[8]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[8]);
        printf("gAlgorithmParam.nOffTime=%d\r\n", gAlgorithmParam.nOffTime);
    }
    else
    {
        printf("write init nv parameter\r\n");
        // 赋初值然后保存flash
        gAlgorithmParam.nMaxMotionLessRangeBin = PARAM_MOTION_MAX ;
        gAlgorithmParam.nMaxMotionRangeBin = PARAM_MOTIONLESS_MAX ;

        gAlgorithmParam.nThresholdValOfMotion[0] = PARAM_MOTION_SENSITIBITY_RANG0;
//        gAlgorithmParam.nThresholdValOfMotionLess[0] = PARAM_MOTIONLESS_SENSITIBITY_RANG0;

        gAlgorithmParam.nThresholdValOfMotion[1] = PARAM_MOTION_SENSITIBITY_RANG1;
//        gAlgorithmParam.nThresholdValOfMotionLess[1] = PARAM_MOTIONLESS_SENSITIBITY_RANG1;

        gAlgorithmParam.nThresholdValOfMotion[2] = PARAM_MOTION_SENSITIBITY_RANG2;
        gAlgorithmParam.nThresholdValOfMotionLess[2] = PARAM_MOTIONLESS_SENSITIBITY_RANG2;

        gAlgorithmParam.nThresholdValOfMotion[3] = PARAM_MOTION_SENSITIBITY_RANG3;
        gAlgorithmParam.nThresholdValOfMotionLess[3] = PARAM_MOTIONLESS_SENSITIBITY_RANG3;

