Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/radar/aiio_radar.c
        gAlgorithmParam.nThresholdValOfMotion[4] = PARAM_MOTION_SENSITIBITY_RANG4;
        gAlgorithmParam.nThresholdValOfMotionLess[4] = PARAM_MOTIONLESS_SENSITIBITY_RANG4;

        gAlgorithmParam.nThresholdValOfMotion[5] = PARAM_MOTION_SENSITIBITY_RANG5;
        gAlgorithmParam.nThresholdValOfMotionLess[5] = PARAM_MOTIONLESS_SENSITIBITY_RANG5;

        gAlgorithmParam.nThresholdValOfMotion[6] = PARAM_MOTION_SENSITIBITY_RANG6;
        gAlgorithmParam.nThresholdValOfMotionLess[6] = PARAM_MOTIONLESS_SENSITIBITY_RANG6;
		
		gAlgorithmParam.nThresholdValOfMotion[6] = PARAM_MOTION_SENSITIBITY_RANG6;
        gAlgorithmParam.nThresholdValOfMotionLess[6] = PARAM_MOTIONLESS_SENSITIBITY_RANG6;
		
		gAlgorithmParam.nThresholdValOfMotion[7] = PARAM_MOTION_SENSITIBITY_RANG7;
        gAlgorithmParam.nThresholdValOfMotionLess[7] = PARAM_MOTIONLESS_SENSITIBITY_RANG7;
		
		gAlgorithmParam.nThresholdValOfMotion[8] = PARAM_MOTION_SENSITIBITY_RANG8;
        gAlgorithmParam.nThresholdValOfMotionLess[8] = PARAM_MOTIONLESS_SENSITIBITY_RANG8;
		
        gAlgorithmParam.nOffTime = PARAM_OFF_TIME;

        printf("gAlgorithmParam.nMaxMotionLessRangeBin=%d\r\n", gAlgorithmParam.nMaxMotionLessRangeBin);
        printf("ggAlgorithmParam.nMaxMotionRangeBin=%d\r\n", gAlgorithmParam.nMaxMotionRangeBin);
        printf("gAlgorithmParam.nThresholdValOfMotion[0]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[0]);
        printf("gAlgorithmParam.nThresholdValOfMotion[1]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[1]);
        printf("gAlgorithmParam.nThresholdValOfMotion[2]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[2]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[2]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[2]);
        printf("gAlgorithmParam.nThresholdValOfMotion[3]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[3]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[3]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[3]);
        printf("gAlgorithmParam.nThresholdValOfMotion[4]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[4]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[4]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[4]);
        printf("gAlgorithmParam.nThresholdValOfMotion[5]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[5]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[5]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[5]);
        printf("gAlgorithmParam.nThresholdValOfMotion[6]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[6]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[6]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[6]);
        printf("gAlgorithmParam.nThresholdValOfMotion[7]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[7]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[7]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[7]);
        printf("gAlgorithmParam.nThresholdValOfMotion[8]=%d\r\n", gAlgorithmParam.nThresholdValOfMotion[8]);
        printf("gAlgorithmParam.nThresholdValOfMotionLess[8]=%d\r\n", gAlgorithmParam.nThresholdValOfMotionLess[8]);
        printf("gAlgorithmParam.nOffTime=%d\r\n", gAlgorithmParam.nOffTime);

        Algo_SaveParameter((uint32_t *)&gAlgorithmParam, sizeof(ALGORITHM_PARAM_T));
    }
}

static void UART_RecvTimeout(void)
{
    if (g_cmdRecv.curIndex > 0)
    {
        g_cmdRecv.idleCnt++;
        if (g_cmdRecv.idleCnt >= CMD_RECV_TIMEOUT)
        {
            g_cmdRecv.cmdReady = 1;
            g_cmdRecv.bufProc = g_cmdRecv.bufRecv;
            g_cmdRecv.bufRecv = (++g_cmdRecv.bufRecv) % BUF_MAX;
            g_cmdRecv.bufLen = g_cmdRecv.curIndex;
            g_cmdRecv.curIndex = 0;
            g_cmdRecv.idleCnt = 0;
			// setUartRecv_Flag();

            xEventGroupSetBits(CmdProcessEventGroup, CMD_PROCESS_BIT);
        }
    }
}

static void uart_recv_timeout_check_task(void *param)
{
    for (;;)
    {
        UART_RecvTimeout();
        vTaskDelay(pdMS_TO_TICKS(2));
    }
}

static void CmdProc_Init(void)
{
    memset(&g_cmdRecv, 0, sizeof(g_cmdRecv));
	InitAlgorithmParam();
}

int32_t aiio_rd01_init(void)
{
    rd01_platform_init();

    //从flash读取配置信息，没有则写入
    Config_Init();

    CmdProcessEventGroup = xEventGroupCreate();
    SPIEventGroup = xEventGroupCreate();
    
    //创建spi队列
    SpiDataQueue = xQueueCreate(FUNC_QUEUE_SIZE, 48);
    if (SpiDataQueue == NULL)
    {
        printf("create queue failed!!!\r\n");
    }

    vTaskDelay(3);

    rd01_reg_init();

#if USER_UART_ENABLE
    xTaskCreate(cmd_process_task, "cmd_pro", 1024, NULL, CMD_PROCESS_TASK_PRIORITY, NULL);
    xTaskCreate(uart_recv_timeout_check_task, "uart_rec_check", 1024, NULL, UART_RECV_CHECK_TASK_PRIORITY, NULL);
#endif //USER_UART_ENABLE

    rd01_data_proc_init();  //数据初始化
    CmdProc_Init();

    xTaskCreate(queue_data_process_task, "data_pro", 1024, NULL, 14, &QueueTaskHandle);

    cs_interrupt_init();

    create_spi_init_task(bsp_spi_slave_init);

    return 0;
}

#endif

